[
  {
    "id": "n1-adv-001",
    "kanji": "あながち",
    "kana": "あながち",
    "romaji": "anagachi",
    "en": "not necessarily; not entirely (used with a negative)",
    "examples": [
      {
        "ja": "あながち彼の考えが間違っているとは言えない。",
        "kana": "あながち かれ の かんがえ が まちがっている とは いえない。",
        "ro": "Anagachi kare no kangae ga machigatteiru to wa ienai.",
        "en": "His idea is not necessarily wrong."
      },
      {
        "ja": "あながち夢とは言えない現実だ。",
        "kana": "あながち ゆめ とは いえない げんじつ だ。",
        "ro": "Anagachi yume to wa ienai genjitsu da.",
        "en": "It’s a reality that’s not entirely a dream."
      },
      {
        "ja": "彼女の言葉もあながち嘘ではない。",
        "kana": "かのじょ の ことば も あながち うそ では ない。",
        "ro": "Kanojo no kotoba mo anagachi uso de wa nai.",
        "en": "Her words are not completely false."
      },
      {
        "ja": "その噂もあながち間違いではないかもしれない。",
        "kana": "その うわさ も あながち まちがい では ない かもしれない。",
        "ro": "Sono uwasa mo anagachi machigai de wa nai kamoshirenai.",
        "en": "That rumor may not be entirely wrong."
      },
      {
        "ja": "あながち冗談とも言えない話だ。",
        "kana": "あながち じょうだん とも いえない はなし だ。",
        "ro": "Anagachi joudan to mo ienai hanashi da.",
        "en": "It’s not something that can be dismissed as just a joke."
      }
    ]
  },
  {
    "id": "n1-adv-002",
    "kanji": "おのずと",
    "kana": "おのずと",
    "romaji": "onozuto",
    "en": "naturally; by itself; automatically; naturally; automatically; of itself",
    "examples": [
      {
        "ja": "努力すればおのずと結果が出る。",
        "kana": "どりょく すれば おのずと けっか が でる。",
        "ro": "Doryoku sureba onozuto kekka ga deru.",
        "en": "If you make an effort, the results will naturally follow."
      },
      {
        "ja": "おのずと答えが見えてくるでしょう。",
        "kana": "おのずと こたえ が みえてくる でしょう。",
        "ro": "Onozuto kotae ga mietekuru deshou.",
        "en": "The answer will naturally reveal itself."
      },
      {
        "ja": "時間がたてばおのずと理解できるようになります。",
        "kana": "じかん が たてば おのずと りかい できる よう に なります。",
        "ro": "Jikan ga tateba onozuto rikai dekiru you ni narimasu.",
        "en": "With time, you will come to understand naturally."
      },
      {
        "ja": "おのずと笑顔がこぼれた。",
        "kana": "おのずと えがお が こぼれた。",
        "ro": "Onozuto egao ga koboreta.",
        "en": "A smile naturally appeared on my face."
      },
      {
        "ja": "信頼関係はおのずと生まれるものだ。",
        "kana": "しんらい かんけい は おのずと うまれる もの だ。",
        "ro": "Shinrai kankei wa onozuto umareru mono da.",
        "en": "Trust is something that develops naturally."
      },
      {
        "ja": "経験を積めばおのずと自信がつく。",
        "kana": "けいけん を つめば おのずと じしん が つく。",
        "ro": "Keiken o tsumeba onozuto jishin ga tsuku.",
        "en": "As you gain experience, confidence will come naturally."
      },
      {
        "ja": "正直に生きればおのずと信頼が得られる。",
        "kana": "しょうじき に いきれば おのずと しんらい が えられる。",
        "ro": "Shoujiki ni ikireba onozuto shinrai ga erareru.",
        "en": "If you live honestly, trust will naturally follow."
      },
      {
        "ja": "理解が深まればおのずと答えが見えてくる。",
        "kana": "りかい が ふかまれば おのずと こたえ が みえて くる。",
        "ro": "Rikai ga fukamareba onozuto kotae ga miete kuru.",
        "en": "As your understanding deepens, the answer becomes clear naturally."
      },
      {
        "ja": "努力すればおのずと道が開ける。",
        "kana": "どりょく すれば おのずと みち が ひらける。",
        "ro": "Doryoku sureba onozuto michi ga hirakeru.",
        "en": "If you put in effort, the path will open naturally."
      }
    ]
  },
  {
    "id": "n1-adv-003",
    "kanji": "いやおうなく",
    "kana": "いやおうなく",
    "romaji": "iyaounaku",
    "en": "unwillingly; without choice; inevitably",
    "examples": [
      {
        "ja": "彼はいやおうなくその計画に参加させられた。",
        "kana": "かれ は いやおうなく その けいかく に さんか させられた。",
        "ro": "Kare wa iyaounaku sono keikaku ni sanka saserareta.",
        "en": "He was forced to join the plan against his will."
      },
      {
        "ja": "私はいやおうなくその場に残った。",
        "kana": "わたし は いやおうなく その ば に のこった。",
        "ro": "Watashi wa iyaounaku sono ba ni nokotta.",
        "en": "I had no choice but to stay there."
      },
      {
        "ja": "いやおうなく会議に出席することになった。",
        "kana": "いやおうなく かいぎ に しゅっせき する こと に なった。",
        "ro": "Iyaounaku kaigi ni shusseki suru koto ni natta.",
        "en": "I ended up attending the meeting unwillingly."
      },
      {
        "ja": "彼女はいやおうなく決断を迫られた。",
        "kana": "かのじょ は いやおうなく けつだん を せまられた。",
        "ro": "Kanojo wa iyaounaku ketsudan o semarareta.",
        "en": "She was forced to make a decision."
      },
      {
        "ja": "いやおうなく責任を取る立場になった。",
        "kana": "いやおうなく せきにん を とる たちば に なった。",
        "ro": "Iyaounaku sekinin o toru tachiba ni natta.",
        "en": "He found himself in a position where he had to take responsibility."
      }
    ]
  },
  {
    "id": "n1-adv-004",
    "kanji": "さも",
    "kana": "さも",
    "romaji": "samo",
    "en": "as if; truly; seemingly; very",
    "examples": [
      {
        "ja": "彼はさも嬉しそうに笑った。",
        "kana": "かれ は さも うれしそう に わらった。",
        "ro": "Kare wa samo ureshisou ni waratta.",
        "en": "He smiled as if he were truly happy."
      },
      {
        "ja": "さも当然のように話していた。",
        "kana": "さも とうぜん の よう に はなしていた。",
        "ro": "Samo touzen no you ni hanashiteita.",
        "en": "He spoke as though it were only natural."
      },
      {
        "ja": "彼女はさも知っているかのような顔をした。",
        "kana": "かのじょ は さも しっている か の よう な かお を した。",
        "ro": "Kanojo wa samo shitteiru ka no you na kao o shita.",
        "en": "She looked as if she knew everything."
      },
      {
        "ja": "さもありそうな話だね。",
        "kana": "さも ありそう な はなし だね。",
        "ro": "Samo arisou na hanashi da ne.",
        "en": "That sounds quite believable."
      },
      {
        "ja": "彼はさも自分が正しいと言わんばかりだった。",
        "kana": "かれ は さも じぶん が ただしい と いわん ばかり だった。",
        "ro": "Kare wa samo jibun ga tadashii to iwan bakari datta.",
        "en": "He acted as if to say he was absolutely right."
      },
      {
        "ja": "彼はさも自分が正しいかのように話す。",
        "kana": "かれ は さも じぶん が ただしい か の よう に はなす。",
        "ro": "Kare wa samo jibun ga tadashii ka no you ni hanasu.",
        "en": "He talks as if he were absolutely right."
      },
      {
        "ja": "彼女はさも嬉しそうに笑った。",
        "kana": "かのじょ は さも うれしそう に わらった。",
        "ro": "Kanojo wa samo ureshisou ni waratta.",
        "en": "She smiled as if she were truly happy."
      },
      {
        "ja": "さも当然のように答えた。",
        "kana": "さも とうぜん の よう に こたえた。",
        "ro": "Samo touzen no you ni kotaeta.",
        "en": "He answered as if it were the most natural thing."
      },
      {
        "ja": "さも興味があるかのように話を聞いた。",
        "kana": "さも きょうみ が ある か の よう に はなし を きいた。",
        "ro": "Samo kyoumi ga aru ka no you ni hanashi o kiita.",
        "en": "He listened as if he were interested."
      },
      {
        "ja": "彼はさも得意げに結果を見せた。",
        "kana": "かれ は さも とくいげ に けっか を みせた。",
        "ro": "Kare wa samo tokuige ni kekka o miseta.",
        "en": "He proudly showed the results, as if to boast."
      }
    ]
  },
  {
    "id": "n1-adv-005",
    "kanji": "とかく",
    "kana": "とかく",
    "romaji": "tokaku",
    "en": "tend to; be apt to; often",
    "examples": [
      {
        "ja": "人はとかく他人を批判しがちだ。",
        "kana": "ひと は とかく たにん を ひはん しがち だ。",
        "ro": "Hito wa tokaku tanin o hihan shigachi da.",
        "en": "People tend to criticize others."
      },
      {
        "ja": "忙しいととかく健康を忘れがちだ。",
        "kana": "いそがしい と とかく けんこう を わすれがち だ。",
        "ro": "Isogashii to tokaku kenkou o wasuregachi da.",
        "en": "When busy, people tend to forget about their health."
      },
      {
        "ja": "とかく噂は大げさになるものだ。",
        "kana": "とかく うわさ は おおげさ に なる もの だ。",
        "ro": "Tokaku uwasa wa oogesa ni naru mono da.",
        "en": "Rumors often get exaggerated."
      },
      {
        "ja": "若者はとかく流行を追いがちだ。",
        "kana": "わかもの は とかく りゅうこう を おいがち だ。",
        "ro": "Wakamono wa tokaku ryuukou o oigachi da.",
        "en": "Young people tend to follow trends."
      },
      {
        "ja": "とかく感情的になりやすい人だ。",
        "kana": "とかく かんじょうてき に なりやすい ひと だ。",
        "ro": "Tokaku kanjouteki ni nariyasui hito da.",
        "en": "He tends to get emotional easily."
      }
    ]
  },
  {
    "id": "n1-adv-006",
    "kanji": "なにとぞ",
    "kana": "なにとぞ",
    "romaji": "nanitozo",
    "en": "please; kindly; I beg of you (formal request); please; kindly; I beg of you (formal); please; kindly; I beg you (formal and polite)",
    "examples": [
      {
        "ja": "なにとぞよろしくお願いいたします。",
        "kana": "なにとぞ よろしく おねがい いたします。",
        "ro": "Nanitozo yoroshiku onegai itashimasu.",
        "en": "I sincerely ask for your kind support."
      },
      {
        "ja": "なにとぞご理解のほどお願いいたします。",
        "kana": "なにとぞ ごりかい の ほど おねがい いたします。",
        "ro": "Nanitozo gorikai no hodo onegai itashimasu.",
        "en": "We kindly ask for your understanding."
      },
      {
        "ja": "なにとぞご協力ください。",
        "kana": "なにとぞ ごきょうりょく ください。",
        "ro": "Nanitozo gokyouryoku kudasai.",
        "en": "Please cooperate with us, if you would."
      },
      {
        "ja": "なにとぞお許しください。",
        "kana": "なにとぞ おゆるし ください。",
        "ro": "Nanitozo oyurushi kudasai.",
        "en": "Please forgive me, I beg you."
      },
      {
        "ja": "なにとぞこの件をお任せください。",
        "kana": "なにとぞ この けん を おまかせ ください。",
        "ro": "Nanitozo kono ken o omakase kudasai.",
        "en": "Please kindly leave this matter to us."
      },
      {
        "ja": "なにとぞご理解ください。",
        "kana": "なにとぞ ごりかい ください。",
        "ro": "Nanitozo gorikai kudasai.",
        "en": "Please understand."
      },
      {
        "ja": "なにとぞお力添えをお願いいたします。",
        "kana": "なにとぞ おちからぞえ を おねがい いたします。",
        "ro": "Nanitozo ochikarazoe o onegai itashimasu.",
        "en": "We sincerely ask for your cooperation."
      },
      {
        "ja": "なにとぞお許しくださいませ。",
        "kana": "なにとぞ おゆるし くださいませ。",
        "ro": "Nanitozo oyurushi kudasaimase.",
        "en": "Please forgive me, I beg of you."
      },
      {
        "ja": "なにとぞご検討のほどお願いいたします。",
        "kana": "なにとぞ ごけんとう の ほど おねがい いたします。",
        "ro": "Nanitozo gokentou no hodo onegai itashimasu.",
        "en": "We kindly ask for your consideration."
      },
      {
        "ja": "なにとぞお力添えください。",
        "kana": "なにとぞ おちからぞえ ください。",
        "ro": "Nanitozo ochikarazoe kudasai.",
        "en": "Please lend us your support."
      },
      {
        "ja": "なにとぞ温かいご支援をお願いいたします。",
        "kana": "なにとぞ あたたかい ごしえん を おねがい いたします。",
        "ro": "Nanitozo atatakai gosien o onegai itashimasu.",
        "en": "We humbly request your warm support."
      }
    ]
  },
  {
    "id": "n1-adv-007",
    "kanji": "ことごとく",
    "kana": "ことごとく",
    "romaji": "kotogotoku",
    "en": "entirely; all; without exception; altogether; entirely; without exception; entirely; without exception; all",
    "examples": [
      {
        "ja": "彼の提案はことごとく却下された。",
        "kana": "かれ の ていあん は ことごとく きゃっか された。",
        "ro": "Kare no teian wa kotogotoku kyakka sareta.",
        "en": "All of his proposals were rejected."
      },
      {
        "ja": "ことごとく失敗に終わった。",
        "kana": "ことごとく しっぱい に おわった。",
        "ro": "Kotogotoku shippai ni owatta.",
        "en": "Everything ended in failure."
      },
      {
        "ja": "彼の予想はことごとく外れた。",
        "kana": "かれ の よそう は ことごとく はずれた。",
        "ro": "Kare no yosou wa kotogotoku hazureta.",
        "en": "All his predictions were wrong."
      },
      {
        "ja": "ことごとく片付けられていた。",
        "kana": "ことごとく かたづけられていた。",
        "ro": "Kotogotoku katazukerareteita.",
        "en": "Everything had been completely cleaned up."
      },
      {
        "ja": "ことごとく計画通りに進んだ。",
        "kana": "ことごとく けいかく どおり に すすんだ。",
        "ro": "Kotogotoku keikaku doori ni susunda.",
        "en": "Everything went exactly as planned."
      },
      {
        "ja": "彼の言葉はことごとく正しかった。",
        "kana": "かれ の ことば は ことごとく ただしかった。",
        "ro": "Kare no kotoba wa kotogotoku tadashikatta.",
        "en": "Everything he said was correct."
      },
      {
        "ja": "彼らの計画はことごとく実現しなかった。",
        "kana": "かれら の けいかく は ことごとく じつげん しなかった。",
        "ro": "Karera no keikaku wa kotogotoku jitsugen shinakatta.",
        "en": "None of their plans came true."
      },
      {
        "ja": "その噂はことごとく事実だった。",
        "kana": "その うわさ は ことごとく じじつ だった。",
        "ro": "Sono uwasa wa kotogotoku jijitsu datta.",
        "en": "All of those rumors turned out to be true."
      },
      {
        "ja": "彼の計画はことごとく失敗した。",
        "kana": "かれ の けいかく は ことごとく しっぱい した。",
        "ro": "Kare no keikaku wa kotogotoku shippai shita.",
        "en": "All of his plans failed completely."
      },
      {
        "ja": "ことごとく反対意見が出た。",
        "kana": "ことごとく はんたい いけん が でた。",
        "ro": "Kotogotoku hantai iken ga deta.",
        "en": "There were objections across the board."
      },
      {
        "ja": "敵の攻撃はことごとく防がれた。",
        "kana": "てき の こうげき は ことごとく ふせがれた。",
        "ro": "Teki no kougeki wa kotogotoku fusegareta.",
        "en": "Every one of the enemy’s attacks was blocked."
      },
      {
        "ja": "彼の計画はことごとく失敗に終わった。",
        "kana": "かれ の けいかく は ことごとく しっぱい に おわった。",
        "ro": "Kare no keikaku wa kotogotoku shippai ni owatta.",
        "en": "Every one of his plans ended in failure."
      },
      {
        "ja": "その噂はことごとく嘘だった。",
        "kana": "その うわさ は ことごとく うそ だった。",
        "ro": "Sono uwasa wa kotogotoku uso datta.",
        "en": "All those rumors turned out to be false."
      }
    ]
  },
  {
    "id": "n1-adv-008",
    "kanji": "ひとえに",
    "kana": "ひとえに",
    "romaji": "hitoeni",
    "en": "solely; entirely; humbly; simply; solely; entirely; purely; entirely; solely; sincerely; wholeheartedly",
    "examples": [
      {
        "ja": "成功はひとえにあなたのおかげです。",
        "kana": "せいこう は ひとえに あなた の おかげ です。",
        "ro": "Seikou wa hitoeni anata no okage desu.",
        "en": "This success is entirely thanks to you."
      },
      {
        "ja": "彼の努力はひとえに家族のためだった。",
        "kana": "かれ の どりょく は ひとえに かぞく の ため だった。",
        "ro": "Kare no doryoku wa hitoeni kazoku no tame datta.",
        "en": "His hard work was solely for his family."
      },
      {
        "ja": "この受賞はひとえに先生のおかげです。",
        "kana": "この じゅしょう は ひとえに せんせい の おかげ です。",
        "ro": "Kono jushou wa hitoeni sensei no okage desu.",
        "en": "This award is purely thanks to my teacher."
      },
      {
        "ja": "ひとえに皆様のご支援によるものです。",
        "kana": "ひとえに みなさま の ごしえん に よる もの です。",
        "ro": "Hitoeni minasama no gosien ni yoru mono desu.",
        "en": "It’s entirely due to everyone’s support."
      },
      {
        "ja": "成功はひとえに本人の努力にかかっている。",
        "kana": "せいこう は ひとえに ほんにん の どりょく に かかっている。",
        "ro": "Seikou wa hitoeni honnin no doryoku ni kakatteiru.",
        "en": "Success depends entirely on the person’s effort."
      },
      {
        "ja": "成功はひとえに皆さんのおかげです。",
        "kana": "せいこう は ひとえに みなさん の おかげ です。",
        "ro": "Seikou wa hitoeni minasan no okage desu.",
        "en": "Our success is entirely thanks to all of you."
      },
      {
        "ja": "今回の結果はひとえに努力の賜物だ。",
        "kana": "こんかい の けっか は ひとえに どりょく の たまもの だ。",
        "ro": "Konkai no kekka wa hitoeni doryoku no tamamono da.",
        "en": "This result is purely the fruit of hard work."
      },
      {
        "ja": "この勝利はひとえにチームの団結によるものだ。",
        "kana": "この しょうり は ひとえに ちーむ の だんけつ に よる もの だ。",
        "ro": "Kono shouri wa hitoeni chiimu no danketsu ni yoru mono da.",
        "en": "This victory is entirely due to the team’s unity."
      },
      {
        "ja": "彼が成功したのはひとえに努力の結果だ。",
        "kana": "かれ が せいこう した の は ひとえに どりょく の けっか だ。",
        "ro": "Kare ga seikou shita no wa hitoeni doryoku no kekka da.",
        "en": "His success is purely the result of effort."
      },
      {
        "ja": "この賞はひとえに彼の功績を称えるものです。",
        "kana": "この しょう は ひとえに かれ の こうせき を たたえる もの です。",
        "ro": "Kono shou wa hitoeni kare no kouseki o tataeru mono desu.",
        "en": "This award is solely to honor his achievement."
      },
      {
        "ja": "この成功はひとえに皆様のおかげです。",
        "kana": "この せいこう は ひとえに みなさま の おかげ です。",
        "ro": "Kono seikou wa hitoeni minasama no okage desu.",
        "en": "This success is entirely thanks to everyone."
      },
      {
        "ja": "彼を信頼しているのはひとえに彼の誠実さだ。",
        "kana": "かれ を しんらい している の は ひとえに かれ の せいじつさ だ。",
        "ro": "Kare o shinrai shiteiru no wa hitoeni kare no seijitsusa da.",
        "en": "My trust in him is solely due to his sincerity."
      },
      {
        "ja": "今回の受賞はひとえに先生のおかげです。",
        "kana": "こんかい の じゅしょう は ひとえに せんせい の おかげ です。",
        "ro": "Konkai no jushou wa hitoeni sensei no okage desu.",
        "en": "This award is entirely thanks to my teacher."
      },
      {
        "ja": "彼の努力はひとえに家族のためだ。",
        "kana": "かれ の どりょく は ひとえに かぞく の ため だ。",
        "ro": "Kare no doryoku wa hitoeni kazoku no tame da.",
        "en": "His effort is purely for the sake of his family."
      },
      {
        "ja": "成功できたのはひとえにチームワークの結果です。",
        "kana": "せいこう できた の は ひとえに ちーむわーく の けっか です。",
        "ro": "Seikou dekita no wa hitoeni chiimuwaaku no kekka desu.",
        "en": "Our success is wholly the result of teamwork."
      }
    ]
  },
  {
    "id": "n1-adv-009",
    "kanji": "もっぱら",
    "kana": "もっぱら",
    "romaji": "moppara",
    "en": "mainly; exclusively; entirely; exclusively; mainly; entirely; devotedly; exclusively; mainly; solely",
    "examples": [
      {
        "ja": "最近はもっぱら在宅勤務です。",
        "kana": "さいきん は もっぱら ざいたく きんむ です。",
        "ro": "Saikin wa moppara zaitaku kinmu desu.",
        "en": "Recently, I’ve been working mainly from home."
      },
      {
        "ja": "休日はもっぱら読書をしています。",
        "kana": "きゅうじつ は もっぱら どくしょ を しています。",
        "ro": "Kyuujitsu wa moppara dokusho o shiteimasu.",
        "en": "On holidays, I spend most of my time reading."
      },
      {
        "ja": "この話題はもっぱらニュースで取り上げられている。",
        "kana": "この わだい は もっぱら にゅーす で とりあげられている。",
        "ro": "Kono wadai wa moppara nyuusu de toriagerareteiru.",
        "en": "This topic is being covered mainly in the news."
      },
      {
        "ja": "もっぱら健康のために運動しています。",
        "kana": "もっぱら けんこう の ため に うんどう しています。",
        "ro": "Moppara kenkou no tame ni undou shiteimasu.",
        "en": "I exercise mainly for my health."
      },
      {
        "ja": "彼はもっぱら営業の仕事を担当している。",
        "kana": "かれ は もっぱら えいぎょう の しごと を たんとう している。",
        "ro": "Kare wa moppara eigyou no shigoto o tantou shiteiru.",
        "en": "He is mainly in charge of sales work."
      },
      {
        "ja": "最近はもっぱら在宅勤務をしている。",
        "kana": "さいきん は もっぱら ざいたく きんむ を している。",
        "ro": "Saikin wa moppara zaitaku kinmu o shiteiru.",
        "en": "Lately, I’ve been working mainly from home."
      },
      {
        "ja": "彼はもっぱら研究に時間を費やしている。",
        "kana": "かれ は もっぱら けんきゅう に じかん を ついやしている。",
        "ro": "Kare wa moppara kenkyuu ni jikan o tsuiyashiteiru.",
        "en": "He devotes most of his time to research."
      },
      {
        "ja": "休日はもっぱら読書を楽しんでいる。",
        "kana": "きゅうじつ は もっぱら どくしょ を たのしんでいる。",
        "ro": "Kyuujitsu wa moppara dokusho o tanoshindeiru.",
        "en": "I spend my days off mainly reading books."
      },
      {
        "ja": "この店はもっぱら常連客で賑わっている。",
        "kana": "この みせ は もっぱら じょうれんきゃく で にぎわっている。",
        "ro": "Kono mise wa moppara jourenkyaku de nigiwatteiru.",
        "en": "This shop is mostly crowded with regular customers."
      },
      {
        "ja": "彼女はもっぱら健康のために運動している。",
        "kana": "かのじょ は もっぱら けんこう の ため に うんどう している。",
        "ro": "Kanojo wa moppara kenkou no tame ni undou shiteiru.",
        "en": "She exercises exclusively for her health."
      },
      {
        "ja": "このレストランはもっぱら魚料理で有名だ。",
        "kana": "この れすとらん は もっぱら さかな りょうり で ゆうめい だ。",
        "ro": "Kono resutoran wa moppara sakana ryouri de yuumei da.",
        "en": "This restaurant is known mainly for its seafood dishes."
      },
      {
        "ja": "休日はもっぱら家で過ごしている。",
        "kana": "きゅうじつ は もっぱら いえ で すごしている。",
        "ro": "Kyuujitsu wa moppara ie de sugoshiteiru.",
        "en": "I usually spend my days off at home."
      },
      {
        "ja": "もっぱら彼の話題で盛り上がった。",
        "kana": "もっぱら かれ の わだい で もりあがった。",
        "ro": "Moppara kare no wadai de moriagatta.",
        "en": "We talked mostly about him."
      },
      {
        "ja": "最近はもっぱら健康について考えている。",
        "kana": "さいきん は もっぱら けんこう に ついて かんがえている。",
        "ro": "Saikin wa moppara kenkou ni tsuite kangaeteiru.",
        "en": "Lately, I’ve been thinking mainly about my health."
      },
      {
        "ja": "彼はもっぱら営業の仕事をしている。",
        "kana": "かれ は もっぱら えいぎょう の しごと を している。",
        "ro": "Kare wa moppara eigyou no shigoto o shiteiru.",
        "en": "He mainly works in sales."
      },
      {
        "ja": "休日はもっぱら家で映画を見ている。",
        "kana": "きゅうじつ は もっぱら いえ で えいが を みている。",
        "ro": "Kyuujitsu wa moppara ie de eiga o miteiru.",
        "en": "I spend my days off mainly watching movies at home."
      },
      {
        "ja": "最近の話題はもっぱら政治だ。",
        "kana": "さいきん の わだい は もっぱら せいじ だ。",
        "ro": "Saikin no wadai wa moppara seiji da.",
        "en": "Lately, the main topic of conversation is politics."
      },
      {
        "ja": "彼はもっぱら英語の勉強に集中している。",
        "kana": "かれ は もっぱら えいご の べんきょう に しゅうちゅう している。",
        "ro": "Kare wa moppara eigo no benkyou ni shuuchuu shiteiru.",
        "en": "He’s focused exclusively on studying English."
      },
      {
        "ja": "このレストランはもっぱら地元の人に人気がある。",
        "kana": "この れすとらん は もっぱら じもと の ひと に にんき が ある。",
        "ro": "Kono resutoran wa moppara jimoto no hito ni ninki ga aru.",
        "en": "This restaurant is popular mainly among locals."
      }
    ]
  },
  {
    "id": "n1-adv-010",
    "kanji": "いたって",
    "kana": "いたって",
    "romaji": "itatte",
    "en": "very; extremely; exceedingly; extremely; very; exceedingly; very; extremely; exceedingly (formal and polite)",
    "examples": [
      {
        "ja": "彼はいたって元気です。",
        "kana": "かれ は いたって げんき です。",
        "ro": "Kare wa itatte genki desu.",
        "en": "He is in very good health."
      },
      {
        "ja": "いたって簡単な問題です。",
        "kana": "いたって かんたん な もんだい です。",
        "ro": "Itatte kantan na mondai desu.",
        "en": "It’s a very simple problem."
      },
      {
        "ja": "その子はいたって素直な性格だ。",
        "kana": "その こ は いたって すなお な せいかく だ。",
        "ro": "Sono ko wa itatte sunao na seikaku da.",
        "en": "That child has a very honest personality."
      },
      {
        "ja": "いたって普通の生活をしています。",
        "kana": "いたって ふつう の せいかつ を しています。",
        "ro": "Itatte futsuu no seikatsu o shiteimasu.",
        "en": "I live a completely ordinary life."
      },
      {
        "ja": "この地域の人々はいたって親切です。",
        "kana": "この ちいき の ひとびと は いたって しんせつ です。",
        "ro": "Kono chiiki no hitobito wa itatte shinsetsu desu.",
        "en": "People in this area are extremely kind."
      },
      {
        "ja": "いたって簡単な方法です。",
        "kana": "いたって かんたん な ほうほう です。",
        "ro": "Itatte kantan na houhou desu.",
        "en": "It’s a very simple method."
      },
      {
        "ja": "彼女はいたってまじめな人だ。",
        "kana": "かのじょ は いたって まじめ な ひと だ。",
        "ro": "Kanojo wa itatte majime na hito da.",
        "en": "She is a very serious person."
      },
      {
        "ja": "いたって普通の一日だった。",
        "kana": "いたって ふつう の いちにち だった。",
        "ro": "Itatte futsuu no ichinichi datta.",
        "en": "It was an entirely ordinary day."
      },
      {
        "ja": "彼の態度はいたって冷静だった。",
        "kana": "かれ の たいど は いたって れいせい だった。",
        "ro": "Kare no taido wa itatte reisei datta.",
        "en": "His attitude was extremely calm."
      },
      {
        "ja": "この料理はいたってシンプルだ。",
        "kana": "この りょうり は いたって しんぷる だ。",
        "ro": "Kono ryouri wa itatte shinpuru da.",
        "en": "This dish is very simple."
      },
      {
        "ja": "彼女の説明はいたって明快だった。",
        "kana": "かのじょ の せつめい は いたって めいかい だった。",
        "ro": "Kanojo no setsumei wa itatte meikai datta.",
        "en": "Her explanation was extremely clear."
      },
      {
        "ja": "彼の性格はいたって穏やかだ。",
        "kana": "かれ の せいかく は いたって おだやか だ。",
        "ro": "Kare no seikaku wa itatte odayaka da.",
        "en": "He has a very calm personality."
      },
      {
        "ja": "この製品はいたって安全です。",
        "kana": "この せいひん は いたって あんぜん です。",
        "ro": "Kono seihin wa itatte anzen desu.",
        "en": "This product is extremely safe."
      }
    ]
  },
  {
    "id": "n1-adv-011",
    "kanji": "なにぶん",
    "kana": "なにぶん",
    "romaji": "nanibun",
    "en": "in any case; please; after all",
    "examples": [
      {
        "ja": "なにぶん初めてのことですので、ご配慮ください。",
        "kana": "なにぶん はじめて の こと です ので、ごはいりょ ください。",
        "ro": "Nanibun hajimete no koto desu node, gohairyo kudasai.",
        "en": "Please be considerate, as this is my first time."
      },
      {
        "ja": "なにぶん経験が浅いもので、至らない点もあります。",
        "kana": "なにぶん けいけん が あさい もので、いたらない てん も あります。",
        "ro": "Nanibun keiken ga asai monode, itaranai ten mo arimasu.",
        "en": "Since I lack experience, there may be some shortcomings."
      },
      {
        "ja": "なにぶんよろしくお願いいたします。",
        "kana": "なにぶん よろしく おねがい いたします。",
        "ro": "Nanibun yoroshiku onegai itashimasu.",
        "en": "I humbly ask for your kind support."
      },
      {
        "ja": "なにぶん天候が不安定なので、計画を変更します。",
        "kana": "なにぶん てんこう が ふあんてい なので、けいかく を へんこう します。",
        "ro": "Nanibun tenkou ga fuantei nanode, keikaku o henkou shimasu.",
        "en": "As the weather is unstable, we’ll change the plan."
      },
      {
        "ja": "なにぶん資金が足りず、延期となりました。",
        "kana": "なにぶん しきん が たりず、えんき と なりました。",
        "ro": "Nanibun shikin ga tarizu, enki to narimashita.",
        "en": "Due to lack of funds, it was postponed."
      }
    ]
  },
  {
    "id": "n1-adv-012",
    "kanji": "あらかじめ",
    "kana": "あらかじめ",
    "romaji": "arakajime",
    "en": "in advance; beforehand; previously",
    "examples": [
      {
        "ja": "参加者はあらかじめ登録してください。",
        "kana": "さんかしゃ は あらかじめ とうろく してください。",
        "ro": "Sankasha wa arakajime touroku shite kudasai.",
        "en": "Participants should register in advance."
      },
      {
        "ja": "あらかじめ準備しておいた方がいい。",
        "kana": "あらかじめ じゅんび して おいた ほう が いい。",
        "ro": "Arakajime junbi shite oita hou ga ii.",
        "en": "It’s better to prepare beforehand."
      },
      {
        "ja": "あらかじめ連絡しておくべきだった。",
        "kana": "あらかじめ れんらく して おく べき だった。",
        "ro": "Arakajime renraku shite oku beki datta.",
        "en": "I should have contacted them beforehand."
      },
      {
        "ja": "問題をあらかじめ確認しておきましょう。",
        "kana": "もんだい を あらかじめ かくにん して おきましょう。",
        "ro": "Mondai o arakajime kakunin shite okimashou.",
        "en": "Let’s check the problems in advance."
      },
      {
        "ja": "あらかじめ説明しておいたので混乱はなかった。",
        "kana": "あらかじめ せつめい して おいた ので こんらん は なかった。",
        "ro": "Arakajime setsumei shite oita node konran wa nakatta.",
        "en": "Since I explained beforehand, there was no confusion."
      },
      {
        "ja": "あらかじめ予約をしておいてください。",
        "kana": "あらかじめ よやく を して おいて ください。",
        "ro": "Arakajime yoyaku o shite oite kudasai.",
        "en": "Please make a reservation in advance."
      },
      {
        "ja": "あらかじめ説明を聞いてから始めましょう。",
        "kana": "あらかじめ せつめい を きいて から はじめましょう。",
        "ro": "Arakajime setsumei o kiite kara hajimemashou.",
        "en": "Let’s listen to the explanation beforehand and then start."
      },
      {
        "ja": "問題はあらかじめ共有されていた。",
        "kana": "もんだい は あらかじめ きょうゆう されていた。",
        "ro": "Mondai wa arakajime kyouyuu sareteita.",
        "en": "The issue had been shared in advance."
      },
      {
        "ja": "あらかじめ用意していた資料を配布した。",
        "kana": "あらかじめ ようい していた しりょう を はいふ した。",
        "ro": "Arakajime youi shiteita shiryou o haifu shita.",
        "en": "We distributed the materials prepared beforehand."
      },
      {
        "ja": "あらかじめ確認しておくと安心です。",
        "kana": "あらかじめ かくにん して おく と あんしん です。",
        "ro": "Arakajime kakunin shite oku to anshin desu.",
        "en": "It’s reassuring to check things in advance."
      }
    ]
  },
  {
    "id": "n1-adv-013",
    "kanji": "さぞ",
    "kana": "さぞ",
    "romaji": "sazo",
    "en": "surely; no doubt; I’m sure that...",
    "examples": [
      {
        "ja": "さぞ疲れたことでしょう。",
        "kana": "さぞ つかれた こと でしょう。",
        "ro": "Sazo tsukareta koto deshou.",
        "en": "You must be very tired."
      },
      {
        "ja": "さぞ驚いたに違いない。",
        "kana": "さぞ おどろいた に ちがい ない。",
        "ro": "Sazo odoroita ni chigai nai.",
        "en": "You must have been very surprised."
      },
      {
        "ja": "さぞお忙しいことと思います。",
        "kana": "さぞ おいそがしい こと と おもいます。",
        "ro": "Sazo oisogashii koto to omoimasu.",
        "en": "I’m sure you are very busy."
      },
      {
        "ja": "彼はさぞ嬉しかったに違いない。",
        "kana": "かれ は さぞ うれしかった に ちがい ない。",
        "ro": "Kare wa sazo ureshikatta ni chigai nai.",
        "en": "He must have been very happy."
      },
      {
        "ja": "さぞ寒かったでしょうね。",
        "kana": "さぞ さむかった でしょう ね。",
        "ro": "Sazo samukatta deshou ne.",
        "en": "It must have been very cold."
      }
    ]
  },
  {
    "id": "n1-adv-014",
    "kanji": "もはや",
    "kana": "もはや",
    "romaji": "mohaya",
    "en": "already; no longer; now (that)",
    "examples": [
      {
        "ja": "もはや手遅れだ。",
        "kana": "もはや ておくれ だ。",
        "ro": "Mohaya teokure da.",
        "en": "It’s already too late."
      },
      {
        "ja": "もはや彼を止めることはできない。",
        "kana": "もはや かれ を とめる こと は できない。",
        "ro": "Mohaya kare o tomeru koto wa dekinai.",
        "en": "There’s no stopping him now."
      },
      {
        "ja": "その問題はもはや解決できない。",
        "kana": "その もんだい は もはや かいけつ できない。",
        "ro": "Sono mondai wa mohaya kaiketsu dekinai.",
        "en": "That issue can no longer be solved."
      },
      {
        "ja": "彼の夢はもはや現実になった。",
        "kana": "かれ の ゆめ は もはや げんじつ に なった。",
        "ro": "Kare no yume wa mohaya genjitsu ni natta.",
        "en": "His dream has already become reality."
      },
      {
        "ja": "もはや過去の話だ。",
        "kana": "もはや かこ の はなし だ。",
        "ro": "Mohaya kako no hanashi da.",
        "en": "That’s a thing of the past now."
      }
    ]
  },
  {
    "id": "n1-adv-015",
    "kanji": "かねて",
    "kana": "かねて",
    "romaji": "kanete",
    "en": "previously; for some time; already; previously; already; for some time",
    "examples": [
      {
        "ja": "かねてよりお世話になっております。",
        "kana": "かねて より おせわ に なって おります。",
        "ro": "Kanete yori osewa ni natte orimasu.",
        "en": "I’ve long been in your care."
      },
      {
        "ja": "かねてからの夢がついに叶った。",
        "kana": "かねて から の ゆめ が ついに かなった。",
        "ro": "Kanete kara no yume ga tsuini kanatta.",
        "en": "My long-held dream finally came true."
      },
      {
        "ja": "かねて計画していた旅行を実行した。",
        "kana": "かねて けいかく していた りょこう を じっこう した。",
        "ro": "Kanete keikaku shiteita ryokou o jikkou shita.",
        "en": "I went on the trip I had planned for a long time."
      },
      {
        "ja": "かねて依頼していた仕事が完了した。",
        "kana": "かねて いらい していた しごと が かんりょう した。",
        "ro": "Kanete irai shiteita shigoto ga kanryou shita.",
        "en": "The task I had requested earlier has been completed."
      },
      {
        "ja": "かねてからの知人に再会した。",
        "kana": "かねて から の ちじん に さいかい した。",
        "ro": "Kanete kara no chijin ni saikai shita.",
        "en": "I met an old acquaintance again."
      },
      {
        "ja": "かねてよりお願いしていた件です。",
        "kana": "かねて より おねがい していた けん です。",
        "ro": "Kanete yori onegai shiteita ken desu.",
        "en": "This is the matter I had requested earlier."
      },
      {
        "ja": "彼とはかねてからの知り合いです。",
        "kana": "かれ と は かねて から の しりあい です。",
        "ro": "Kare to wa kanete kara no shiriai desu.",
        "en": "I’ve known him for some time."
      },
      {
        "ja": "かねて準備していた計画を実行した。",
        "kana": "かねて じゅんび していた けいかく を じっこう した。",
        "ro": "Kanete junbi shiteita keikaku o jikkou shita.",
        "en": "We carried out the plan we had prepared in advance."
      },
      {
        "ja": "かねてよりの夢がついに叶った。",
        "kana": "かねて より の ゆめ が ついに かなった。",
        "ro": "Kanete yori no yume ga tsuini kanatta.",
        "en": "The dream I had long cherished has finally come true."
      },
      {
        "ja": "かねて連絡していた通り、明日伺います。",
        "kana": "かねて れんらく していた とおり、 あした うかがいます。",
        "ro": "Kanete renraku shiteita toori, ashita ukagaimasu.",
        "en": "As I mentioned before, I’ll visit tomorrow."
      }
    ]
  },
  {
    "id": "n1-adv-016",
    "kanji": "まして",
    "kana": "まして",
    "romaji": "mashite",
    "en": "let alone; much more; needless to say; let alone; not to mention; much less",
    "examples": [
      {
        "ja": "大人でも難しいのに、まして子どもには無理だ。",
        "kana": "おとな でも むずかしい のに、まして こども には むり だ。",
        "ro": "Otona demo muzukashii noni, mashite kodomo ni wa muri da.",
        "en": "It’s hard even for adults, let alone for children."
      },
      {
        "ja": "彼でもできなかった。まして私にはできない。",
        "kana": "かれ でも できなかった。まして わたし には できない。",
        "ro": "Kare demo dekinakatta. Mashite watashi ni wa dekinai.",
        "en": "Even he couldn’t do it—there’s no way I can."
      },
      {
        "ja": "経験者でも大変なのに、まして初心者は苦労するだろう。",
        "kana": "けいけんしゃ でも たいへん なのに、まして しょしんしゃ は くろう する だろう。",
        "ro": "Keikensha demo taihen nanoni, mashite shoshinsha wa kurou suru darou.",
        "en": "It’s tough even for experts, let alone beginners."
      },
      {
        "ja": "英語も難しいのに、ましてフランス語はもっと難しい。",
        "kana": "えいご も むずかしい のに、まして ふらんすご は もっと むずかしい。",
        "ro": "Eigo mo muzukashii noni, mashite furansugo wa motto muzukashii.",
        "en": "English is difficult, and French even more so."
      },
      {
        "ja": "一人で無理だったのに、まして短時間では不可能だ。",
        "kana": "ひとり で むり だった のに、まして たんじかん では ふかのう だ。",
        "ro": "Hitori de muri datta noni, mashite tanjikan de wa fukanou da.",
        "en": "It was impossible alone—much less in such a short time."
      },
      {
        "ja": "彼でもできないのに、まして私には無理だ。",
        "kana": "かれ でも できない のに、まして わたし に は むり だ。",
        "ro": "Kare demo dekinai noni, mashite watashi ni wa muri da.",
        "en": "If even he can’t do it, there’s no way I can."
      },
      {
        "ja": "英語でも大変なのに、ましてフランス語は難しい。",
        "kana": "えいご でも たいへん なのに、まして ふらんすご は むずかしい。",
        "ro": "Eigo demo taihen nanoni, mashite furansugo wa muzukashii.",
        "en": "English is hard enough, let alone French."
      },
      {
        "ja": "彼のようなプロでも失敗する。まして素人ならなおさらだ。",
        "kana": "かれ の よう な ぷろ でも しっぱい する。まして しろうと なら なおさら だ。",
        "ro": "Kare no you na puro demo shippai suru. Mashite shirouto nara naosara da.",
        "en": "Even a professional like him can fail, much more an amateur."
      },
      {
        "ja": "彼女は疲れているのに、まして子どもの世話までしている。",
        "kana": "かのじょ は つかれている のに、まして こども の せわ まで している。",
        "ro": "Kanojo wa tsukareteiru noni, mashite kodomo no sewa made shiteiru.",
        "en": "She’s exhausted, and on top of that, she’s taking care of her children."
      }
    ]
  },
  {
    "id": "n1-adv-017",
    "kanji": "さほど",
    "kana": "さほど",
    "romaji": "sahodo",
    "en": "not so much; not particularly; not that; not so much; not particularly; not that (degree); not particularly; not so much; not that",
    "examples": [
      {
        "ja": "さほど暑くないので、冷房はつけなくていい。",
        "kana": "さほど あつく ない ので、れいぼう は つけなくて いい。",
        "ro": "Sahodo atsuku nai node, reibou wa tsukenakute ii.",
        "en": "It’s not so hot, so we don’t need the air conditioner."
      },
      {
        "ja": "試験はさほど難しくなかった。",
        "kana": "しけん は さほど むずかしく なかった。",
        "ro": "Shiken wa sahodo muzukashiku nakatta.",
        "en": "The exam wasn’t that difficult."
      },
      {
        "ja": "彼はさほど怒っていないようだ。",
        "kana": "かれ は さほど おこって いない よう だ。",
        "ro": "Kare wa sahodo okotte inai you da.",
        "en": "He doesn’t seem all that angry."
      },
      {
        "ja": "その映画はさほど面白くなかった。",
        "kana": "その えいが は さほど おもしろく なかった。",
        "ro": "Sono eiga wa sahodo omoshiroku nakatta.",
        "en": "That movie wasn’t particularly interesting."
      },
      {
        "ja": "さほど時間はかからないでしょう。",
        "kana": "さほど じかん は かからない でしょう。",
        "ro": "Sahodo jikan wa kakaranai deshou.",
        "en": "It shouldn’t take that much time."
      },
      {
        "ja": "さほど重要な問題ではない。",
        "kana": "さほど じゅうよう な もんだい では ない。",
        "ro": "Sahodo juuyou na mondai de wa nai.",
        "en": "It’s not such an important issue."
      },
      {
        "ja": "さほど難しいことではない。",
        "kana": "さほど むずかしい こと では ない。",
        "ro": "Sahodo muzukashii koto de wa nai.",
        "en": "It’s not particularly difficult."
      },
      {
        "ja": "そのニュースにはさほど驚かなかった。",
        "kana": "その にゅーす には さほど おどろかなかった。",
        "ro": "Sono nyuusu ni wa sahodo odorokanakatta.",
        "en": "I wasn’t that surprised by the news."
      },
      {
        "ja": "さほど時間はかからないと思う。",
        "kana": "さほど じかん は かからない と おもう。",
        "ro": "Sahodo jikan wa kakaranai to omou.",
        "en": "I don’t think it will take that long."
      },
      {
        "ja": "彼はさほど親しい友人ではない。",
        "kana": "かれ は さほど したしい ゆうじん では ない。",
        "ro": "Kare wa sahodo shitashii yuujin de wa nai.",
        "en": "He’s not that close a friend."
      },
      {
        "ja": "さほど疲れていない。",
        "kana": "さほど つかれて いない。",
        "ro": "Sahodo tsukarete inai.",
        "en": "I’m not that tired."
      },
      {
        "ja": "その問題はさほど重要ではない。",
        "kana": "その もんだい は さほど じゅうよう では ない。",
        "ro": "Sono mondai wa sahodo juuyou de wa nai.",
        "en": "That issue isn’t particularly important."
      },
      {
        "ja": "彼の話はさほど驚くことではなかった。",
        "kana": "かれ の はなし は さほど おどろく こと では なかった。",
        "ro": "Kare no hanashi wa sahodo odoroku koto de wa nakatta.",
        "en": "His story wasn’t that surprising."
      },
      {
        "ja": "さほど待たずに順番が来た。",
        "kana": "さほど またず に じゅんばん が きた。",
        "ro": "Sahodo matazu ni junban ga kita.",
        "en": "I didn’t have to wait that long for my turn."
      },
      {
        "ja": "この問題はさほど難しくない。",
        "kana": "この もんだい は さほど むずかしく ない。",
        "ro": "Kono mondai wa sahodo muzukashiku nai.",
        "en": "This problem isn’t that difficult."
      },
      {
        "ja": "彼の話はさほど面白くなかった。",
        "kana": "かれ の はなし は さほど おもしろく なかった。",
        "ro": "Kare no hanashi wa sahodo omoshiroku nakatta.",
        "en": "His story wasn’t very interesting."
      },
      {
        "ja": "今日はさほど寒くない。",
        "kana": "きょう は さほど さむく ない。",
        "ro": "Kyou wa sahodo samuku nai.",
        "en": "It’s not that cold today."
      },
      {
        "ja": "その映画はさほど人気がない。",
        "kana": "その えいが は さほど にんき が ない。",
        "ro": "Sono eiga wa sahodo ninki ga nai.",
        "en": "That movie isn’t particularly popular."
      },
      {
        "ja": "彼はさほど疲れていないようだ。",
        "kana": "かれ は さほど つかれて いない よう だ。",
        "ro": "Kare wa sahodo tsukarete inai you da.",
        "en": "He doesn’t seem very tired."
      }
    ]
  },
  {
    "id": "n1-adv-018",
    "kanji": "いたるところ",
    "kana": "いたるところ",
    "romaji": "itarutokoro",
    "en": "everywhere; all over the place; everywhere; all over; in every place",
    "examples": [
      {
        "ja": "街のいたるところにカメラが設置されている。",
        "kana": "まち の いたるところ に かめら が せっち されている。",
        "ro": "Machi no itarutokoro ni kamera ga setchi sareteiru.",
        "en": "Cameras are installed all over the city."
      },
      {
        "ja": "公園には花がいたるところに咲いている。",
        "kana": "こうえん に はな が いたるところ に さいている。",
        "ro": "Kouen ni wa hana ga itarutokoro ni saiteiru.",
        "en": "Flowers are blooming everywhere in the park."
      },
      {
        "ja": "いたるところで祭りの準備が始まっていた。",
        "kana": "いたるところ で まつり の じゅんび が はじまっていた。",
        "ro": "Itarutokoro de matsuri no junbi ga hajimatteita.",
        "en": "Preparations for the festival had begun everywhere."
      },
      {
        "ja": "いたるところにゴミが散らかっていた。",
        "kana": "いたるところ に ごみ が ちらかっていた。",
        "ro": "Itarutokoro ni gomi ga chirakatteita.",
        "en": "Trash was scattered all over the place."
      },
      {
        "ja": "いたるところで音楽が流れていた。",
        "kana": "いたるところ で おんがく が ながれていた。",
        "ro": "Itarutokoro de ongaku ga nagareteita.",
        "en": "Music was playing everywhere."
      },
      {
        "ja": "日本にはいたるところに自動販売機がある。",
        "kana": "にほん に は いたるところ に じどう はんばいき が ある。",
        "ro": "Nihon ni wa itaru tokoro ni jidou hanbaiki ga aru.",
        "en": "There are vending machines everywhere in Japan."
      },
      {
        "ja": "いたるところで桜が咲いている。",
        "kana": "いたるところ で さくら が さいている。",
        "ro": "Itaru tokoro de sakura ga saiteiru.",
        "en": "Cherry blossoms are blooming everywhere."
      },
      {
        "ja": "いたるところに落ち葉が積もっている。",
        "kana": "いたるところ に おちば が つもっている。",
        "ro": "Itaru tokoro ni ochiba ga tsumotteiru.",
        "en": "Fallen leaves are piled up everywhere."
      },
      {
        "ja": "観光地にはいたるところにお土産屋がある。",
        "kana": "かんこうち に は いたるところ に おみやげや が ある。",
        "ro": "Kankouchi ni wa itaru tokoro ni omiyageya ga aru.",
        "en": "There are souvenir shops everywhere in tourist areas."
      },
      {
        "ja": "街のいたるところに防犯カメラが設置されている。",
        "kana": "まち の いたるところ に ぼうはん かめら が せっち されている。",
        "ro": "Machi no itaru tokoro ni bouhan kamera ga setchi sareteiru.",
        "en": "Security cameras are installed all over the city."
      }
    ]
  },
  {
    "id": "n1-adv-019",
    "kanji": "いかにも",
    "kana": "いかにも",
    "romaji": "ikanimo",
    "en": "indeed; really; truly; very much so",
    "examples": [
      {
        "ja": "彼はいかにも先生らしい話し方をする。",
        "kana": "かれ は いかにも せんせい らしい はなしかた を する。",
        "ro": "Kare wa ikanimo sensei rashii hanashikata o suru.",
        "en": "He really talks like a teacher."
      },
      {
        "ja": "いかにも彼らしい失敗だ。",
        "kana": "いかにも かれ らしい しっぱい だ。",
        "ro": "Ikanimo kare rashii shippai da.",
        "en": "That’s such a typical mistake for him."
      },
      {
        "ja": "彼女はいかにも優しそうな人だ。",
        "kana": "かのじょ は いかにも やさしそう な ひと だ。",
        "ro": "Kanojo wa ikanimo yasashisou na hito da.",
        "en": "She looks like a genuinely kind person."
      },
      {
        "ja": "いかにも高級そうなホテルだ。",
        "kana": "いかにも こうきゅう そう な ほてる だ。",
        "ro": "Ikanimo koukyuu sou na hoteru da.",
        "en": "It’s an obviously luxurious hotel."
      },
      {
        "ja": "いかにも彼の言いそうなことだ。",
        "kana": "いかにも かれ の いいそう な こと だ。",
        "ro": "Ikanimo kare no iisou na koto da.",
        "en": "That’s exactly something he would say."
      }
    ]
  },
  {
    "id": "n1-adv-020",
    "kanji": "ひとまず",
    "kana": "ひとまず",
    "romaji": "hitomazu",
    "en": "for the time being; for now; temporarily",
    "examples": [
      {
        "ja": "ひとまず休憩しよう。",
        "kana": "ひとまず きゅうけい しよう。",
        "ro": "Hitomazu kyuukei shiyou.",
        "en": "Let’s take a break for now."
      },
      {
        "ja": "ひとまず安心した。",
        "kana": "ひとまず あんしん した。",
        "ro": "Hitomazu anshin shita.",
        "en": "I’m relieved for the time being."
      },
      {
        "ja": "ひとまずこの案で進めましょう。",
        "kana": "ひとまず この あん で すすめましょう。",
        "ro": "Hitomazu kono an de susumemashou.",
        "en": "Let’s go with this plan for now."
      },
      {
        "ja": "ひとまず問題は解決したようだ。",
        "kana": "ひとまず もんだい は かいけつ した よう だ。",
        "ro": "Hitomazu mondai wa kaiketsu shita you da.",
        "en": "It seems the issue has been resolved for now."
      },
      {
        "ja": "ひとまず帰宅してから考えよう。",
        "kana": "ひとまず きたく して から かんがえよう。",
        "ro": "Hitomazu kitaku shite kara kangaeyou.",
        "en": "Let’s go home first and think about it later."
      }
    ]
  },
  {
    "id": "n1-adv-021",
    "kanji": "かろうじて",
    "kana": "かろうじて",
    "romaji": "karoujite",
    "en": "barely; narrowly; just managed to",
    "examples": [
      {
        "ja": "かろうじて試験に合格した。",
        "kana": "かろうじて しけん に ごうかく した。",
        "ro": "Karoujite shiken ni goukaku shita.",
        "en": "I barely passed the exam."
      },
      {
        "ja": "かろうじて終電に間に合った。",
        "kana": "かろうじて しゅうでん に まにあった。",
        "ro": "Karoujite shuuden ni mania atta.",
        "en": "I just managed to catch the last train."
      },
      {
        "ja": "彼はかろうじて逃げ出した。",
        "kana": "かれ は かろうじて にげだした。",
        "ro": "Kare wa karoujite nigedashita.",
        "en": "He barely managed to escape."
      },
      {
        "ja": "かろうじて間違いに気づいた。",
        "kana": "かろうじて まちがい に きづいた。",
        "ro": "Karoujite machigai ni kidzuita.",
        "en": "I barely noticed the mistake."
      },
      {
        "ja": "かろうじて目標を達成した。",
        "kana": "かろうじて もくひょう を たっせい した。",
        "ro": "Karoujite mokuhyou o tassei shita.",
        "en": "I narrowly achieved my goal."
      },
      {
        "ja": "かろうじて間に合った。",
        "kana": "かろうじて まにあった。",
        "ro": "Karoujite mania atta.",
        "en": "I managed to make it just in time."
      },
      {
        "ja": "彼はかろうじて生き延びた。",
        "kana": "かれ は かろうじて いきのびた。",
        "ro": "Kare wa karoujite ikinobita.",
        "en": "He barely survived."
      },
      {
        "ja": "かろうじてバランスを保った。",
        "kana": "かろうじて ばらんす を たもった。",
        "ro": "Karoujite baransu o tamotta.",
        "en": "He barely managed to keep his balance."
      },
      {
        "ja": "かろうじて答えを思い出した。",
        "kana": "かろうじて こたえ を おもいだした。",
        "ro": "Karoujite kotae o omoidashita.",
        "en": "I just managed to recall the answer."
      }
    ]
  },
  {
    "id": "n1-adv-022",
    "kanji": "もしくは",
    "kana": "もしくは",
    "romaji": "moshikuwa",
    "en": "or; otherwise; alternatively",
    "examples": [
      {
        "ja": "電話、もしくはメールでご連絡ください。",
        "kana": "でんわ、もしくは めーる で ごれんらく ください。",
        "ro": "Denwa, moshikuwa meeru de gorenraku kudasai.",
        "en": "Please contact us by phone or email."
      },
      {
        "ja": "AもしくはBのどちらかを選んでください。",
        "kana": "A もしくは B の どちらか を えらんで ください。",
        "ro": "A moshikuwa B no dochiraka o erande kudasai.",
        "en": "Please choose either A or B."
      },
      {
        "ja": "もしくは別の日に変更できますか？",
        "kana": "もしくは べつ の ひ に へんこう できます か？",
        "ro": "Moshikuwa betsuno hi ni henkou dekimasu ka?",
        "en": "Can we change it to another day instead?"
      },
      {
        "ja": "お支払いはカード、もしくは現金でお願いします。",
        "kana": "おしはらい は かーど、もしくは げんきん で おねがい します。",
        "ro": "Oshiharai wa kaado, moshikuwa genkin de onegai shimasu.",
        "en": "Please pay by card or cash."
      },
      {
        "ja": "直接お越しいただくか、もしくはオンラインでご参加ください。",
        "kana": "ちょくせつ おこしいただく か、もしくは おんらいん で ごさんか ください。",
        "ro": "Chokusetsu okoshii tadaku ka, moshikuwa onrain de gosanka kudasai.",
        "en": "Please join us in person or online."
      }
    ]
  },
  {
    "id": "n1-adv-023",
    "kanji": "すんなり",
    "kana": "すんなり",
    "romaji": "sunnari",
    "en": "smoothly; easily; without trouble",
    "examples": [
      {
        "ja": "話がすんなりまとまった。",
        "kana": "はなし が すんなり まとまった。",
        "ro": "Hanashi ga sunnari matomatta.",
        "en": "The discussion was settled smoothly."
      },
      {
        "ja": "すんなり許してくれた。",
        "kana": "すんなり ゆるして くれた。",
        "ro": "Sunnari yurushite kureta.",
        "en": "He forgave me easily."
      },
      {
        "ja": "その手続きはすんなり終わった。",
        "kana": "その てつづき は すんなり おわった。",
        "ro": "Sono tetsuzuki wa sunnari owatta.",
        "en": "The procedure went smoothly."
      },
      {
        "ja": "彼はすんなり合格した。",
        "kana": "かれ は すんなり ごうかく した。",
        "ro": "Kare wa sunnari goukaku shita.",
        "en": "He passed without any trouble."
      },
      {
        "ja": "すんなりドアが開いた。",
        "kana": "すんなり どあ が あいた。",
        "ro": "Sunnari doa ga aita.",
        "en": "The door opened smoothly."
      }
    ]
  },
  {
    "id": "n1-adv-024",
    "kanji": "あくまで",
    "kana": "あくまで",
    "romaji": "akumade",
    "en": "to the end; stubbornly; only; purely; to the end; persistently; purely; after all; to the end; persistently; purely; strictly speaking",
    "examples": [
      {
        "ja": "これはあくまで私の意見です。",
        "kana": "これ は あくまで わたし の いけん です。",
        "ro": "Kore wa akumade watashi no iken desu.",
        "en": "This is only my personal opinion."
      },
      {
        "ja": "彼はあくまで自分の主張を曲げなかった。",
        "kana": "かれ は あくまで じぶん の しゅちょう を まげなかった。",
        "ro": "Kare wa akumade jibun no shuchou o magenakatta.",
        "en": "He never gave up his argument."
      },
      {
        "ja": "あくまで挑戦し続けるつもりだ。",
        "kana": "あくまで ちょうせん しつづける つもり だ。",
        "ro": "Akumade chousen shitsuzukeru tsumori da.",
        "en": "I intend to keep challenging to the very end."
      },
      {
        "ja": "それはあくまで仮の話です。",
        "kana": "それ は あくまで かり の はなし です。",
        "ro": "Sore wa akumade kari no hanashi desu.",
        "en": "That’s only a hypothetical story."
      },
      {
        "ja": "あくまで冷静さを保つようにした。",
        "kana": "あくまで れいせいさ を たもつ ように した。",
        "ro": "Akumade reiseisa o tamotsu you ni shita.",
        "en": "I tried to stay calm until the end."
      },
      {
        "ja": "これはあくまで私の個人的な意見です。",
        "kana": "これは あくまで わたし の こじんてき な いけん です。",
        "ro": "Kore wa akumade watashi no kojinteki na iken desu.",
        "en": "This is, after all, just my personal opinion."
      },
      {
        "ja": "あくまで目標を達成するつもりだ。",
        "kana": "あくまで もくひょう を たっせい する つもり だ。",
        "ro": "Akumade mokuhyou o tassei suru tsumori da.",
        "en": "I intend to achieve my goal no matter what."
      },
      {
        "ja": "あくまで冷静に対応すべきだ。",
        "kana": "あくまで れいせい に たいおう すべき だ。",
        "ro": "Akumade reisei ni taiou subeki da.",
        "en": "We should remain calm to the very end."
      },
      {
        "ja": "それはあくまで仮の話だ。",
        "kana": "それ は あくまで かり の はなし だ。",
        "ro": "Sore wa akumade kari no hanashi da.",
        "en": "That’s only a hypothetical situation."
      },
      {
        "ja": "彼はあくまで自分の考えを貫いた。",
        "kana": "かれ は あくまで じぶん の かんがえ を つらぬいた。",
        "ro": "Kare wa akumade jibun no kangae o tsuranuita.",
        "en": "He stuck to his own opinion to the very end."
      },
      {
        "ja": "これはあくまで個人の意見です。",
        "kana": "これは あくまで こじん の いけん です。",
        "ro": "Kore wa akumade kojin no iken desu.",
        "en": "This is, strictly speaking, a personal opinion."
      },
      {
        "ja": "彼女はあくまで諦めなかった。",
        "kana": "かのじょ は あくまで あきらめなかった。",
        "ro": "Kanojo wa akumade akiramenakatta.",
        "en": "She never gave up until the very end."
      },
      {
        "ja": "あくまで理論上の話だ。",
        "kana": "あくまで りろんじょう の はなし だ。",
        "ro": "Akumade rironjou no hanashi da.",
        "en": "This is purely a theoretical discussion."
      },
      {
        "ja": "あくまで冷静に行動してください。",
        "kana": "あくまで れいせい に こうどう して ください。",
        "ro": "Akumade reisei ni koudou shite kudasai.",
        "en": "Please act calmly to the end."
      }
    ]
  },
  {
    "id": "n1-adv-025",
    "kanji": "かつて",
    "kana": "かつて",
    "romaji": "katsute",
    "en": "once; formerly; ever; before",
    "examples": [
      {
        "ja": "かつてこの町は港として栄えた。",
        "kana": "かつて この まち は みなと として さかえた。",
        "ro": "Katsute kono machi wa minato toshite sakaeta.",
        "en": "This town once flourished as a port."
      },
      {
        "ja": "かつて彼と一緒に働いていた。",
        "kana": "かつて かれ と いっしょ に はたらいていた。",
        "ro": "Katsute kare to issho ni hataraiteita.",
        "en": "I used to work with him once."
      },
      {
        "ja": "かつての友人に再会した。",
        "kana": "かつて の ゆうじん に さいかい した。",
        "ro": "Katsute no yuujin ni saikai shita.",
        "en": "I met an old friend again."
      },
      {
        "ja": "この場所はかつて城が建っていた。",
        "kana": "この ばしょ は かつて しろ が たっていた。",
        "ro": "Kono basho wa katsute shiro ga tatteita.",
        "en": "A castle once stood here."
      },
      {
        "ja": "かつて経験したことのない出来事だった。",
        "kana": "かつて けいけん した こと の ない できごと だった。",
        "ro": "Katsute keiken shita koto no nai dekigoto datta.",
        "en": "It was something I had never experienced before."
      }
    ]
  },
  {
    "id": "n1-adv-026",
    "kanji": "いずれ",
    "kana": "いずれ",
    "romaji": "izure",
    "en": "sooner or later; eventually; at some time; which; eventually; someday; sooner or later",
    "examples": [
      {
        "ja": "いずれ結果がわかるだろう。",
        "kana": "いずれ けっか が わかる だろう。",
        "ro": "Izure kekka ga wakaru darou.",
        "en": "We’ll know the result sooner or later."
      },
      {
        "ja": "いずれまたお会いしましょう。",
        "kana": "いずれ また おあい しましょう。",
        "ro": "Izure mata oai shimashou.",
        "en": "Let’s meet again sometime."
      },
      {
        "ja": "いずれ彼も理解してくれるはずだ。",
        "kana": "いずれ かれ も りかい して くれる はず だ。",
        "ro": "Izure kare mo rikai shite kureru hazu da.",
        "en": "He’ll understand eventually."
      },
      {
        "ja": "この問題は、いずれ解決されるだろう。",
        "kana": "この もんだい は、いずれ かいけつ される だろう。",
        "ro": "Kono mondai wa, izure kaiketsu sareru darou.",
        "en": "This issue will be resolved sooner or later."
      },
      {
        "ja": "いずれの日か夢を叶えたい。",
        "kana": "いずれ の ひ か ゆめ を かなえたい。",
        "ro": "Izure no hi ka yume o kanaetai.",
        "en": "Someday, I want to make my dream come true."
      },
      {
        "ja": "いずれ結果はわかるだろう。",
        "kana": "いずれ けっか は わかる だろう。",
        "ro": "Izure kekka wa wakaru darou.",
        "en": "We’ll know the result eventually."
      },
      {
        "ja": "いずれ彼も理解してくれるだろう。",
        "kana": "いずれ かれ も りかい して くれる だろう。",
        "ro": "Izure kare mo rikai shite kureru darou.",
        "en": "He’ll understand it sooner or later."
      },
      {
        "ja": "いずれにしても、やるしかない。",
        "kana": "いずれ に しても、やる しか ない。",
        "ro": "Izure ni shitemo, yaru shika nai.",
        "en": "In any case, we just have to do it."
      },
      {
        "ja": "いずれ彼はその事実を知ることになる。",
        "kana": "いずれ かれ は その じじつ を しる こと に なる。",
        "ro": "Izure kare wa sono jijitsu o shiru koto ni naru.",
        "en": "He will come to know the truth sooner or later."
      }
    ]
  },
  {
    "id": "n1-adv-028",
    "kanji": "なおさら",
    "kana": "なおさら",
    "romaji": "naosara",
    "en": "even more; all the more; still less; all the more; even more; still more",
    "examples": [
      {
        "ja": "彼が失敗したと聞いて、なおさら心配になった。",
        "kana": "かれ が しっぱい した と きいて、なおさら しんぱい に なった。",
        "ro": "Kare ga shippai shita to kiite, naosara shinpai ni natta.",
        "en": "When I heard he failed, I became even more worried."
      },
      {
        "ja": "寒いのに風が吹いて、なおさら寒く感じる。",
        "kana": "さむい のに かぜ が ふいて、なおさら さむく かんじる。",
        "ro": "Samui noni kaze ga fuite, naosara samuku kanjiru.",
        "en": "It feels even colder with the wind blowing."
      },
      {
        "ja": "努力しても成果が出ないと、なおさら悔しい。",
        "kana": "どりょく しても せいか が でない と、なおさら くやしい。",
        "ro": "Doryoku shitemo seika ga denai to, naosara kuyashii.",
        "en": "It’s all the more frustrating when effort doesn’t pay off."
      },
      {
        "ja": "彼の態度を見て、なおさら嫌いになった。",
        "kana": "かれ の たいど を みて、なおさら きらい に なった。",
        "ro": "Kare no taido o mite, naosara kirai ni natta.",
        "en": "After seeing his attitude, I disliked him even more."
      },
      {
        "ja": "彼が真剣だから、なおさら応援したくなる。",
        "kana": "かれ が しんけん だから、なおさら おうえん したく なる。",
        "ro": "Kare ga shinken dakara, naosara ouen shitaku naru.",
        "en": "Because he’s so serious, I want to support him even more."
      },
      {
        "ja": "雨が降って、なおさら寒く感じる。",
        "kana": "あめ が ふって、なおさら さむく かんじる。",
        "ro": "Ame ga futte, naosara samuku kanjiru.",
        "en": "The rain makes it feel even colder."
      },
      {
        "ja": "失敗してなおさらやる気が出た。",
        "kana": "しっぱい して なおさら やるき が でた。",
        "ro": "Shippai shite naosara yaruki ga deta.",
        "en": "Failing made me even more motivated."
      },
      {
        "ja": "彼の態度を見て、なおさら信用できなくなった。",
        "kana": "かれ の たいど を みて、なおさら しんよう できなく なった。",
        "ro": "Kare no taido o mite, naosara shinyou dekinaku natta.",
        "en": "Seeing his attitude made me trust him even less."
      },
      {
        "ja": "彼女が褒められて、なおさら努力した。",
        "kana": "かのじょ が ほめられて、なおさら どりょく した。",
        "ro": "Kanojo ga homerarete, naosara doryoku shita.",
        "en": "She worked even harder after being praised."
      },
      {
        "ja": "説明を聞いたら、なおさら行きたくなった。",
        "kana": "せつめい を きいたら、なおさら いきたく なった。",
        "ro": "Setsumei o kiitara, naosara ikitaku natta.",
        "en": "After hearing the explanation, I wanted to go all the more."
      }
    ]
  },
  {
    "id": "n1-adv-029",
    "kanji": "ひたすら",
    "kana": "ひたすら",
    "romaji": "hitasura",
    "en": "earnestly; intently; single-mindedly",
    "examples": [
      {
        "ja": "彼はひたすら練習に励んでいる。",
        "kana": "かれ は ひたすら れんしゅう に はげんでいる。",
        "ro": "Kare wa hitasura renshuu ni hagendeiru.",
        "en": "He is earnestly devoted to practice."
      },
      {
        "ja": "成功を信じてひたすら努力した。",
        "kana": "せいこう を しんじて ひたすら どりょく した。",
        "ro": "Seikou o shinjite hitasura doryoku shita.",
        "en": "He worked hard, believing in success."
      },
      {
        "ja": "彼女はひたすら前を見て歩いた。",
        "kana": "かのじょ は ひたすら まえ を みて あるいた。",
        "ro": "Kanojo wa hitasura mae o mite aruita.",
        "en": "She kept walking, looking straight ahead."
      },
      {
        "ja": "ひたすら家族の幸せを願っている。",
        "kana": "ひたすら かぞく の しあわせ を ねがっている。",
        "ro": "Hitasura kazoku no shiawase o negatteiru.",
        "en": "I’m wholeheartedly wishing for my family’s happiness."
      },
      {
        "ja": "彼はひたすら謝り続けた。",
        "kana": "かれ は ひたすら あやまり つづけた。",
        "ro": "Kare wa hitasura ayamari tsudzuketa.",
        "en": "He kept apologizing sincerely."
      }
    ]
  },
  {
    "id": "n1-adv-030",
    "kanji": "まるごと",
    "kana": "まるごと",
    "romaji": "marugoto",
    "en": "whole; entirely; in its entirety",
    "examples": [
      {
        "ja": "りんごをまるごと食べた。",
        "kana": "りんご を まるごと たべた。",
        "ro": "Ringo o marugoto tabeta.",
        "en": "I ate the whole apple."
      },
      {
        "ja": "この本をまるごと暗記した。",
        "kana": "この ほん を まるごと あんき した。",
        "ro": "Kono hon o marugoto anki shita.",
        "en": "I memorized the entire book."
      },
      {
        "ja": "建物をまるごと改装する予定だ。",
        "kana": "たてもの を まるごと かいそう する よてい だ。",
        "ro": "Tatemono o marugoto kaisou suru yotei da.",
        "en": "We plan to renovate the whole building."
      },
      {
        "ja": "データをまるごと消してしまった。",
        "kana": "でーた を まるごと けして しまった。",
        "ro": "Deeta o marugoto keshite shimatta.",
        "en": "I accidentally erased all the data."
      },
      {
        "ja": "まるごと彼に任せて大丈夫だ。",
        "kana": "まるごと かれ に まかせて だいじょうぶ だ。",
        "ro": "Marugoto kare ni makasete daijoubu da.",
        "en": "It’s fine to leave everything entirely to him."
      }
    ]
  },
  {
    "id": "n1-adv-032",
    "kanji": "ひいては",
    "kana": "ひいては",
    "romaji": "hiitewa",
    "en": "consequently; in turn; in the long run; and consequently; in turn; eventually",
    "examples": [
      {
        "ja": "努力は自分の成長、ひいては社会の発展につながる。",
        "kana": "どりょく は じぶん の せいちょう、ひいては しゃかい の はってん に つながる。",
        "ro": "Doryoku wa jibun no seichou, hiitewa shakai no hatten ni tsunagaru.",
        "en": "Effort leads to personal growth, and ultimately to social progress."
      },
      {
        "ja": "環境を守ることは、ひいては未来の子どもたちを守ることだ。",
        "kana": "かんきょう を まもる こと は、ひいては みらい の こどもたち を まもる こと だ。",
        "ro": "Kankyou o mamoru koto wa, hiitewa mirai no kodomotachi o mamoru koto da.",
        "en": "Protecting the environment means protecting future generations."
      },
      {
        "ja": "健康を保つことは、ひいては仕事の効率にもつながる。",
        "kana": "けんこう を たもつ こと は、ひいては しごと の こうりつ にも つながる。",
        "ro": "Kenkou o tamotsu koto wa, hiitewa shigoto no kouritsu nimo tsunagaru.",
        "en": "Staying healthy improves work efficiency in the long run."
      },
      {
        "ja": "教育の充実は、ひいては国全体の発展につながる。",
        "kana": "きょういく の じゅうじつ は、ひいては くに ぜんたい の はってん に つながる。",
        "ro": "Kyouiku no juujitsu wa, hiitewa kuni zentai no hatten ni tsunagaru.",
        "en": "Improved education will lead to the nation’s growth."
      },
      {
        "ja": "会社の成功は、ひいては社員全員の幸福に関係している。",
        "kana": "かいしゃ の せいこう は、ひいては しゃいん ぜんいん の こうふく に かんけい している。",
        "ro": "Kaisha no seikou wa, hiitewa shain zen'in no koufuku ni kankei shiteiru.",
        "en": "A company’s success is connected to the happiness of all employees."
      },
      {
        "ja": "努力は自分の成長につながり、ひいては社会の発展にも寄与する。",
        "kana": "どりょく は じぶん の せいちょう に つながり、ひいては しゃかい の はってん に も きよ する。",
        "ro": "Doryoku wa jibun no seichou ni tsunagari, hiite wa shakai no hatten ni mo kiyo suru.",
        "en": "Effort leads to personal growth and, in turn, contributes to society’s development."
      },
      {
        "ja": "環境保護はひいては人類の未来を守ることになる。",
        "kana": "かんきょう ほご は ひいては じんるい の みらい を まもる こと に なる。",
        "ro": "Kankyou hogo wa hiite wa jinrui no mirai o mamoru koto ni naru.",
        "en": "Environmental protection ultimately means safeguarding humanity’s future."
      },
      {
        "ja": "正しい生活習慣は、ひいては健康の維持につながる。",
        "kana": "ただしい せいかつ しゅうかん は、ひいては けんこう の いじ に つながる。",
        "ro": "Tadashii seikatsu shuukan wa, hiite wa kenkou no iji ni tsunagaru.",
        "en": "Healthy habits will, in turn, lead to maintaining good health."
      },
      {
        "ja": "小さな行動の積み重ねが、ひいては大きな成果につながる。",
        "kana": "ちいさな こうどう の つみかさね が、ひいては おおきな せいか に つながる。",
        "ro": "Chiisana koudou no tsumikasane ga, hiite wa ookina seika ni tsunagaru.",
        "en": "Small actions, when accumulated, eventually lead to big results."
      },
      {
        "ja": "教育の充実は、ひいては国の発展を支える。",
        "kana": "きょういく の じゅうじつ は、ひいては くに の はってん を ささえる。",
        "ro": "Kyouiku no juujitsu wa, hiite wa kuni no hatten o sasaeru.",
        "en": "Enhancing education will ultimately support the development of the nation."
      }
    ]
  },
  {
    "id": "n1-adv-033",
    "kanji": "まんまと",
    "kana": "まんまと",
    "romaji": "manmato",
    "en": "successfully; completely; easily (often with a negative nuance)",
    "examples": [
      {
        "ja": "彼はまんまとだまされた。",
        "kana": "かれ は まんまと だまされた。",
        "ro": "Kare wa manmato damasareta.",
        "en": "He was completely deceived."
      },
      {
        "ja": "泥棒はまんまと逃げ出した。",
        "kana": "どろぼう は まんまと にげだした。",
        "ro": "Dorobou wa manmato nigedashita.",
        "en": "The thief managed to escape successfully."
      },
      {
        "ja": "彼女はまんまと契約を勝ち取った。",
        "kana": "かのじょ は まんまと けいやく を かちとった。",
        "ro": "Kanojo wa manmato keiyaku o kachitotta.",
        "en": "She successfully secured the contract."
      },
      {
        "ja": "彼の嘘にまんまと引っかかった。",
        "kana": "かれ の うそ に まんまと ひっかかった。",
        "ro": "Kare no uso ni manmato hikkakatta.",
        "en": "I fell for his lie completely."
      },
      {
        "ja": "まんまと計画通りに進んだ。",
        "kana": "まんまと けいかく どおり に すすんだ。",
        "ro": "Manmato keikaku doori ni susunda.",
        "en": "Everything went exactly as planned."
      }
    ]
  },
  {
    "id": "n1-adv-034",
    "kanji": "ろくに",
    "kana": "ろくに",
    "romaji": "rokuni",
    "en": "properly; sufficiently; well (usually used with negatives)",
    "examples": [
      {
        "ja": "彼はろくに勉強していない。",
        "kana": "かれ は ろくに べんきょう していない。",
        "ro": "Kare wa rokuni benkyou shite inai.",
        "en": "He hardly studies at all."
      },
      {
        "ja": "ろくに寝ていないので、眠い。",
        "kana": "ろくに ねていない ので、ねむい。",
        "ro": "Rokuni nete inai node, nemui.",
        "en": "I’m sleepy because I haven’t slept properly."
      },
      {
        "ja": "彼はろくに挨拶もしなかった。",
        "kana": "かれ は ろくに あいさつ も しなかった。",
        "ro": "Kare wa rokuni aisatsu mo shinakatta.",
        "en": "He didn’t even greet properly."
      },
      {
        "ja": "ろくに食事を取らないで働いている。",
        "kana": "ろくに しょくじ を とらないで はたらいている。",
        "ro": "Rokuni shokuji o toranaide hataraiteiru.",
        "en": "He’s been working without eating properly."
      },
      {
        "ja": "説明もろくに聞かずに文句を言うのはよくない。",
        "kana": "せつめい も ろくに きかず に もんく を いう の は よくない。",
        "ro": "Setsumei mo rokuni kikazu ni monku o iu no wa yokunai.",
        "en": "It’s bad to complain without even listening properly to the explanation."
      }
    ]
  },
  {
    "id": "n1-adv-036",
    "kanji": "やけに",
    "kana": "やけに",
    "romaji": "yakeni",
    "en": "awfully; unusually; excessively",
    "examples": [
      {
        "ja": "今日はやけに静かだね。",
        "kana": "きょう は やけに しずか だ ね。",
        "ro": "Kyou wa yakeni shizuka da ne.",
        "en": "It’s unusually quiet today."
      },
      {
        "ja": "彼はやけに機嫌がいい。",
        "kana": "かれ は やけに きげん が いい。",
        "ro": "Kare wa yakeni kigen ga ii.",
        "en": "He’s in an awfully good mood."
      },
      {
        "ja": "この料理はやけに辛い。",
        "kana": "この りょうり は やけに からい。",
        "ro": "Kono ryouri wa yakeni karai.",
        "en": "This dish is unusually spicy."
      },
      {
        "ja": "やけに時間が経つのが早い。",
        "kana": "やけに じかん が たつ の が はやい。",
        "ro": "Yakeni jikan ga tatsu no ga hayai.",
        "en": "Time seems to pass awfully fast."
      },
      {
        "ja": "彼女はやけに元気そうに見えた。",
        "kana": "かのじょ は やけに げんき そう に みえた。",
        "ro": "Kanojo wa yakeni genki sou ni mieta.",
        "en": "She looked unusually energetic."
      }
    ]
  },
  {
    "id": "n1-adv-037",
    "kanji": "やたらに",
    "kana": "やたらに",
    "romaji": "yatarani",
    "en": "recklessly; thoughtlessly; excessively",
    "examples": [
      {
        "ja": "やたらに人の話に口を出さないで。",
        "kana": "やたらに ひと の はなし に くち を ださないで。",
        "ro": "Yatarani hito no hanashi ni kuchi o dasanaide.",
        "en": "Don’t interrupt other people’s conversations carelessly."
      },
      {
        "ja": "やたらに薬を飲むのは危険だ。",
        "kana": "やたらに くすり を のむ の は きけん だ。",
        "ro": "Yatarani kusuri o nomu no wa kiken da.",
        "en": "It’s dangerous to take medicine recklessly."
      },
      {
        "ja": "彼はやたらに写真を撮りたがる。",
        "kana": "かれ は やたらに しゃしん を とりたがる。",
        "ro": "Kare wa yatarani shashin o toritagaru.",
        "en": "He has an excessive desire to take photos."
      },
      {
        "ja": "やたらに怒る人は信頼できない。",
        "kana": "やたらに おこる ひと は しんらい できない。",
        "ro": "Yatarani okoru hito wa shinrai dekinai.",
        "en": "People who get angry too easily can’t be trusted."
      },
      {
        "ja": "やたらにお金を使ってはいけない。",
        "kana": "やたらに おかね を つかって は いけない。",
        "ro": "Yatarani okane o tsukatte wa ikenai.",
        "en": "You shouldn’t spend money carelessly."
      }
    ]
  },
  {
    "id": "n1-adv-038",
    "kanji": "とっさに",
    "kana": "とっさに",
    "romaji": "tossani",
    "en": "instantly; on the spur of the moment",
    "examples": [
      {
        "ja": "とっさにハンドルを切った。",
        "kana": "とっさに はんどる を きった。",
        "ro": "Tossani handoru o kitta.",
        "en": "I turned the steering wheel instinctively."
      },
      {
        "ja": "質問されて、とっさに答えられなかった。",
        "kana": "しつもん されて、とっさに こたえられなかった。",
        "ro": "Shitsumon sarete, tossani kotaerarenakatta.",
        "en": "I was asked a question but couldn’t answer right away."
      },
      {
        "ja": "とっさに逃げ出した。",
        "kana": "とっさに にげだした。",
        "ro": "Tossani nigedashita.",
        "en": "I ran away instinctively."
      },
      {
        "ja": "とっさに体が動いた。",
        "kana": "とっさに からだ が うごいた。",
        "ro": "Tossani karada ga ugoita.",
        "en": "My body moved on impulse."
      },
      {
        "ja": "とっさに謝ってしまった。",
        "kana": "とっさに あやまって しまった。",
        "ro": "Tossani ayamette shimatta.",
        "en": "I apologized instinctively."
      }
    ]
  },
  {
    "id": "n1-adv-039",
    "kanji": "どうやら",
    "kana": "どうやら",
    "romaji": "douyara",
    "en": "it seems; apparently; somehow",
    "examples": [
      {
        "ja": "どうやら雨が降りそうだ。",
        "kana": "どうやら あめ が ふりそう だ。",
        "ro": "Douyara ame ga furisou da.",
        "en": "It looks like it’s going to rain."
      },
      {
        "ja": "どうやら彼は約束を忘れたようだ。",
        "kana": "どうやら かれ は やくそく を わすれた よう だ。",
        "ro": "Douyara kare wa yakusoku o wasureta you da.",
        "en": "Apparently, he forgot the appointment."
      },
      {
        "ja": "どうやら間に合いそうだ。",
        "kana": "どうやら まにあい そう だ。",
        "ro": "Douyara maniaiso da.",
        "en": "It seems we’ll make it in time."
      },
      {
        "ja": "どうやら問題は解決したようだ。",
        "kana": "どうやら もんだい は かいけつ した よう だ。",
        "ro": "Douyara mondai wa kaiketsu shita you da.",
        "en": "It appears that the problem has been solved."
      },
      {
        "ja": "どうやら彼女は本気らしい。",
        "kana": "どうやら かのじょ は ほんき らしい。",
        "ro": "Douyara kanojo wa honki rashii.",
        "en": "It seems she’s serious."
      }
    ]
  },
  {
    "id": "n1-adv-040",
    "kanji": "いやに",
    "kana": "いやに",
    "romaji": "iyani",
    "en": "awfully; unusually; strangely (often with negative nuance)",
    "examples": [
      {
        "ja": "今日はいやに寒いね。",
        "kana": "きょう は いやに さむい ね。",
        "ro": "Kyou wa iyani samui ne.",
        "en": "It’s awfully cold today."
      },
      {
        "ja": "彼はいやに親切だった。",
        "kana": "かれ は いやに しんせつ だった。",
        "ro": "Kare wa iyani shinsetsu datta.",
        "en": "He was strangely kind."
      },
      {
        "ja": "いやに静かだと思ったら、誰もいなかった。",
        "kana": "いやに しずか だ と おもったら、だれ も いなかった。",
        "ro": "Iya ni shizuka da to omottara, dare mo inakatta.",
        "en": "I thought it was unusually quiet—turns out no one was there."
      },
      {
        "ja": "彼女はいやに落ち着いていた。",
        "kana": "かのじょ は いやに おちついていた。",
        "ro": "Kanojo wa iyani ochitsuiteita.",
        "en": "She was unusually calm."
      },
      {
        "ja": "この部屋はいやに暑い。",
        "kana": "この へや は いやに あつい。",
        "ro": "Kono heya wa iyani atsui.",
        "en": "This room is uncomfortably hot."
      }
    ]
  },
  {
    "id": "n1-adv-042",
    "kanji": "ことによると",
    "kana": "ことによると",
    "romaji": "koto ni yoru to",
    "en": "possibly; maybe; by some chance",
    "examples": [
      {
        "ja": "ことによると彼は来ないかもしれない。",
        "kana": "こと に よる と かれ は こない かも しれない。",
        "ro": "Koto ni yoru to kare wa konai kamo shirenai.",
        "en": "He might not come, perhaps."
      },
      {
        "ja": "ことによると雨になるかもしれない。",
        "kana": "こと に よる と あめ に なる かも しれない。",
        "ro": "Koto ni yoru to ame ni naru kamo shirenai.",
        "en": "It might rain, possibly."
      },
      {
        "ja": "ことによると彼女は真実を知っているかもしれない。",
        "kana": "こと に よる と かのじょ は しんじつ を しっている かも しれない。",
        "ro": "Koto ni yoru to kanojo wa shinjitsu o shitteiru kamo shirenai.",
        "en": "She may possibly know the truth."
      },
      {
        "ja": "ことによると明日出発できないかもしれない。",
        "kana": "こと に よる と あした しゅっぱつ できない かも しれない。",
        "ro": "Koto ni yoru to ashita shuppatsu dekinai kamo shirenai.",
        "en": "We might not be able to leave tomorrow."
      },
      {
        "ja": "ことによると彼が正しかったのかもしれない。",
        "kana": "こと に よる と かれ が ただしかった の かも しれない。",
        "ro": "Koto ni yoru to kare ga tadashikatta no kamo shirenai.",
        "en": "Maybe he was right after all."
      }
    ]
  },
  {
    "id": "n1-adv-045",
    "kanji": "著しく",
    "kana": "いちじるしく",
    "romaji": "ichijirushiku",
    "en": "remarkably; noticeably; strikingly",
    "examples": [
      {
        "ja": "この地域の人口は著しく減少している。",
        "kana": "この ちいき の じんこう は いちじるしく げんしょう している。",
        "ro": "Kono chiiki no jinkou wa ichijirushiku genshou shiteiru.",
        "en": "The population in this area has decreased remarkably."
      },
      {
        "ja": "彼の日本語能力は著しく向上した。",
        "kana": "かれ の にほんご のうりょく は いちじるしく こうじょう した。",
        "ro": "Kare no nihongo nouryoku wa ichijirushiku koujou shita.",
        "en": "His Japanese ability has improved noticeably."
      },
      {
        "ja": "近年、気温が著しく上昇している。",
        "kana": "きんねん、きおん が いちじるしく じょうしょう している。",
        "ro": "Kinnen, kion ga ichijirushiku joushou shiteiru.",
        "en": "In recent years, temperatures have risen sharply."
      },
      {
        "ja": "この製品の品質は著しく良くなった。",
        "kana": "この せいひん の ひんしつ は いちじるしく よく なった。",
        "ro": "Kono seihin no hinshitsu wa ichijirushiku yoku natta.",
        "en": "The quality of this product has become remarkably better."
      },
      {
        "ja": "技術の発展により生活が著しく変化した。",
        "kana": "ぎじゅつ の はってん に より せいかつ が いちじるしく へんか した。",
        "ro": "Gijutsu no hatten ni yori seikatsu ga ichijirushiku henka shita.",
        "en": "Life has changed drastically due to technological progress."
      }
    ]
  },
  {
    "id": "n1-adv-046",
    "kanji": "おのずから",
    "kana": "おのずから",
    "romaji": "onozukara",
    "en": "naturally; by itself; automatically",
    "examples": [
      {
        "ja": "努力すれば結果はおのずからついてくる。",
        "kana": "どりょく すれば けっか は おのずから ついて くる。",
        "ro": "Doryoku sureba kekka wa onozukara tsuite kuru.",
        "en": "If you make an effort, the results will naturally follow."
      },
      {
        "ja": "おのずから理解できるようになる。",
        "kana": "おのずから りかい できる よう に なる。",
        "ro": "Onozukara rikai dekiru you ni naru.",
        "en": "You will come to understand it naturally."
      },
      {
        "ja": "時間が経てばおのずから答えが出るだろう。",
        "kana": "じかん が たてば おのずから こたえ が でる だろう。",
        "ro": "Jikan ga tateba onozukara kotae ga deru darou.",
        "en": "In time, the answer will reveal itself."
      },
      {
        "ja": "真剣に考えれば、おのずから道が見えてくる。",
        "kana": "しんけん に かんがえれば、 おのずから みち が みえて くる。",
        "ro": "Shinken ni kangaereba, onozukara michi ga miete kuru.",
        "en": "If you think seriously, the path will naturally become clear."
      },
      {
        "ja": "信頼は努力すればおのずから生まれる。",
        "kana": "しんらい は どりょく すれば おのずから うまれる。",
        "ro": "Shinrai wa doryoku sureba onozukara umareru.",
        "en": "Trust will naturally develop if you make an effort."
      }
    ]
  },
  {
    "id": "n1-adv-047",
    "kanji": "あえて",
    "kana": "あえて",
    "romaji": "aete",
    "en": "dare to; boldly; intentionally (despite difficulty)",
    "examples": [
      {
        "ja": "彼はあえて危険な道を選んだ。",
        "kana": "かれ は あえて きけん な みち を えらんだ。",
        "ro": "Kare wa aete kiken na michi o eranda.",
        "en": "He dared to choose a dangerous path."
      },
      {
        "ja": "あえて反対意見を言う必要はない。",
        "kana": "あえて はんたい いけん を いう ひつよう は ない。",
        "ro": "Aete hantai iken o iu hitsuyou wa nai.",
        "en": "There’s no need to deliberately voice an opposing opinion."
      },
      {
        "ja": "彼女はあえて本音を言わなかった。",
        "kana": "かのじょ は あえて ほんね を いわなかった。",
        "ro": "Kanojo wa aete honne o iwanakatta.",
        "en": "She chose not to express her true feelings."
      },
      {
        "ja": "あえて言えば、それは失敗ではない。",
        "kana": "あえて いえば、それ は しっぱい では ない。",
        "ro": "Aete ieba, sore wa shippai de wa nai.",
        "en": "If I dare say so, that’s not really a failure."
      },
      {
        "ja": "彼はあえて困難に挑戦した。",
        "kana": "かれ は あえて こんなん に ちょうせん した。",
        "ro": "Kare wa aete konnan ni chousen shita.",
        "en": "He deliberately challenged himself to something difficult."
      }
    ]
  },
  {
    "id": "n1-adv-048",
    "kanji": "しきりに",
    "kana": "しきりに",
    "romaji": "shikirini",
    "en": "frequently; repeatedly; eagerly",
    "examples": [
      {
        "ja": "彼はしきりに電話をかけてきた。",
        "kana": "かれ は しきりに でんわ を かけて きた。",
        "ro": "Kare wa shikirini denwa o kakete kita.",
        "en": "He kept calling repeatedly."
      },
      {
        "ja": "しきりに雨が降っている。",
        "kana": "しきりに あめ が ふっている。",
        "ro": "Shikirini ame ga futteiru.",
        "en": "It’s been raining constantly."
      },
      {
        "ja": "彼女はしきりに感謝の言葉を述べた。",
        "kana": "かのじょ は しきりに かんしゃ の ことば を のべた。",
        "ro": "Kanojo wa shikirini kansha no kotoba o nobeta.",
        "en": "She repeatedly expressed her gratitude."
      },
      {
        "ja": "しきりに人が出入りしている。",
        "kana": "しきりに ひと が でいり している。",
        "ro": "Shikirini hito ga deiri shiteiru.",
        "en": "People keep coming and going."
      },
      {
        "ja": "彼はしきりにうなずいていた。",
        "kana": "かれ は しきりに うなずいて いた。",
        "ro": "Kare wa shikirini unazuite ita.",
        "en": "He was nodding repeatedly."
      }
    ]
  },
  {
    "id": "n1-adv-049",
    "kanji": "おおいに",
    "kana": "おおいに",
    "romaji": "ooini",
    "en": "greatly; very much; to a large extent",
    "examples": [
      {
        "ja": "彼の努力はおおいに評価された。",
        "kana": "かれ の どりょく は おおいに ひょうか された。",
        "ro": "Kare no doryoku wa ooini hyouka sareta.",
        "en": "His efforts were greatly appreciated."
      },
      {
        "ja": "おおいに楽しんでください。",
        "kana": "おおいに たのしんで ください。",
        "ro": "Ooini tanoshinde kudasai.",
        "en": "Please enjoy yourself to the fullest."
      },
      {
        "ja": "その意見にはおおいに賛成です。",
        "kana": "その いけん には おおいに さんせい です。",
        "ro": "Sono iken ni wa ooini sansei desu.",
        "en": "I strongly agree with that opinion."
      },
      {
        "ja": "彼の演説はおおいに人々を感動させた。",
        "kana": "かれ の えんぜつ は おおいに ひとびと を かんどう させた。",
        "ro": "Kare no enzetsu wa ooini hitobito o kandou saseta.",
        "en": "His speech deeply moved many people."
      },
      {
        "ja": "おおいに練習して上達しよう。",
        "kana": "おおいに れんしゅう して じょうたつ しよう。",
        "ro": "Ooini renshuu shite joutatsu shiyou.",
        "en": "Let’s practice a lot and improve."
      }
    ]
  },
  {
    "id": "n1-adv-050",
    "kanji": "じっくり",
    "kana": "じっくり",
    "romaji": "jikkuri",
    "en": "deliberately; carefully; thoroughly",
    "examples": [
      {
        "ja": "じっくり考えてから答えてください。",
        "kana": "じっくり かんがえて から こたえて ください。",
        "ro": "Jikkuri kangaete kara kotaete kudasai.",
        "en": "Please think carefully before answering."
      },
      {
        "ja": "じっくり話を聞きましょう。",
        "kana": "じっくり はなし を ききましょう。",
        "ro": "Jikkuri hanashi o kikimashou.",
        "en": "Let’s listen carefully to the story."
      },
      {
        "ja": "じっくり勉強すれば理解できる。",
        "kana": "じっくり べんきょう すれば りかい できる。",
        "ro": "Jikkuri benkyou sureba rikai dekiru.",
        "en": "If you study carefully, you’ll understand."
      },
      {
        "ja": "じっくり見れば違いがわかる。",
        "kana": "じっくり みれば ちがい が わかる。",
        "ro": "Jikkuri mireba chigai ga wakaru.",
        "en": "If you look closely, you’ll notice the difference."
      },
      {
        "ja": "時間をかけてじっくり仕上げた作品だ。",
        "kana": "じかん を かけて じっくり しあげた さくひん だ。",
        "ro": "Jikan o kakete jikkuri shiageta sakuhin da.",
        "en": "It’s a piece I carefully finished over time."
      }
    ]
  },
  {
    "id": "n1-adv-057",
    "kanji": "いっそ",
    "kana": "いっそ",
    "romaji": "isso",
    "en": "rather; sooner; instead; might as well",
    "examples": [
      {
        "ja": "失敗するくらいなら、いっそやらない方がいい。",
        "kana": "しっぱい する くらい なら、いっそ やらない ほう が いい。",
        "ro": "Shippai suru kurai nara, isso yaranai hou ga ii.",
        "en": "If you’re going to fail, you might as well not do it."
      },
      {
        "ja": "いっそ会社を辞めようかと思った。",
        "kana": "いっそ かいしゃ を やめよう か と おもった。",
        "ro": "Isso kaisha o yameyou ka to omotta.",
        "en": "I even thought I might as well quit my job."
      },
      {
        "ja": "思い切って、いっそ海外に住もうか。",
        "kana": "おもいきって、いっそ かいがい に すもう か。",
        "ro": "Omoikitte, isso kaigai ni sumou ka.",
        "en": "Maybe I should just move abroad once and for all."
      },
      {
        "ja": "もう間に合わないなら、いっそ諦めよう。",
        "kana": "もう まにあわない なら、いっそ あきらめよう。",
        "ro": "Mou maniawanai nara, isso akirameyou.",
        "en": "If we can’t make it, we might as well give up."
      },
      {
        "ja": "彼は怒るより、いっそ笑っていた。",
        "kana": "かれ は おこる より、いっそ わらっていた。",
        "ro": "Kare wa okoru yori, isso waratte ita.",
        "en": "Rather than getting angry, he just laughed instead."
      }
    ]
  },
  {
    "id": "n1-adv-060",
    "kanji": "やがて",
    "kana": "やがて",
    "romaji": "yagate",
    "en": "soon; before long; eventually",
    "examples": [
      {
        "ja": "やがて春が訪れる。",
        "kana": "やがて はる が おとずれる。",
        "ro": "Yagate haru ga otozureru.",
        "en": "Spring will come soon."
      },
      {
        "ja": "やがて子どもたちは大人になる。",
        "kana": "やがて こどもたち は おとな に なる。",
        "ro": "Yagate kodomotachi wa otona ni naru.",
        "en": "Before long, children grow into adults."
      },
      {
        "ja": "やがて雨は止むだろう。",
        "kana": "やがて あめ は やむ だろう。",
        "ro": "Yagate ame wa yamu darou.",
        "en": "The rain will eventually stop."
      },
      {
        "ja": "やがて夜が明ける。",
        "kana": "やがて よる が あける。",
        "ro": "Yagate yoru ga akeru.",
        "en": "Soon the night will end."
      },
      {
        "ja": "やがて彼は有名な作家となった。",
        "kana": "やがて かれ は ゆうめい な さっか と なった。",
        "ro": "Yagate kare wa yuumei na sakka to natta.",
        "en": "He eventually became a famous writer."
      }
    ]
  },
  {
    "id": "n1-adv-062",
    "kanji": "しだいに",
    "kana": "しだいに",
    "romaji": "shidaini",
    "en": "gradually; little by little",
    "examples": [
      {
        "ja": "天気はしだいに回復してきた。",
        "kana": "てんき は しだいに かいふく してきた。",
        "ro": "Tenki wa shidaini kaifuku shite kita.",
        "en": "The weather has been gradually improving."
      },
      {
        "ja": "彼の顔がしだいに明るくなった。",
        "kana": "かれ の かお が しだいに あかるく なった。",
        "ro": "Kare no kao ga shidaini akaruku natta.",
        "en": "His expression gradually brightened."
      },
      {
        "ja": "景気はしだいに悪化している。",
        "kana": "けいき は しだいに あっか している。",
        "ro": "Keiki wa shidaini akka shiteiru.",
        "en": "The economy is gradually worsening."
      },
      {
        "ja": "しだいに夜が明けてきた。",
        "kana": "しだいに よる が あけてきた。",
        "ro": "Shidaini yoru ga akete kita.",
        "en": "The night slowly began to turn into morning."
      },
      {
        "ja": "彼の声はしだいに小さくなった。",
        "kana": "かれ の こえ は しだいに ちいさく なった。",
        "ro": "Kare no koe wa shidaini chiisaku natta.",
        "en": "His voice gradually became quieter."
      }
    ]
  },
  {
    "id": "n1-adv-063",
    "kanji": "まんいち",
    "kana": "まんいち",
    "romaji": "man'ichi",
    "en": "by any chance; in the worst case; if by any means",
    "examples": [
      {
        "ja": "まんいちのために保険に入っておこう。",
        "kana": "まんいち の ため に ほけん に はいって おこう。",
        "ro": "Man'ichi no tame ni hoken ni haitte okou.",
        "en": "Let’s get insurance just in case."
      },
      {
        "ja": "まんいち事故が起きたらどうする？",
        "kana": "まんいち じこ が おきたら どう する？",
        "ro": "Man'ichi jiko ga okitara dou suru?",
        "en": "What will you do if an accident happens?"
      },
      {
        "ja": "まんいちの時に備えて準備しておこう。",
        "kana": "まんいち の とき に そなえて じゅんび して おこう。",
        "ro": "Man'ichi no toki ni sonaete junbi shite okou.",
        "en": "Let’s prepare for emergencies just in case."
      },
      {
        "ja": "まんいち問題が起きたら、すぐ連絡してください。",
        "kana": "まんいち もんだい が おきたら、すぐ れんらく して ください。",
        "ro": "Man'ichi mondai ga okitara, sugu renraku shite kudasai.",
        "en": "If something happens, please contact me immediately."
      },
      {
        "ja": "まんいちの可能性を無視するわけにはいかない。",
        "kana": "まんいち の かのうせい を むし する わけ に は いかない。",
        "ro": "Man'ichi no kanousei o mushi suru wake ni wa ikanai.",
        "en": "We can’t ignore even a small chance of it happening."
      }
    ]
  },
  {
    "id": "n1-adv-065",
    "kanji": "なにげなく",
    "kana": "なにげなく",
    "romaji": "nanigenaku",
    "en": "casually; unintentionally; without thinking",
    "examples": [
      {
        "ja": "なにげなく言った一言が彼を傷つけた。",
        "kana": "なにげなく いった ひとこと が かれ を きずつけた。",
        "ro": "Nanigenaku itta hitokoto ga kare o kizutsuketa.",
        "en": "A casual remark hurt him deeply."
      },
      {
        "ja": "なにげなくテレビをつけた。",
        "kana": "なにげなく てれび を つけた。",
        "ro": "Nanigenaku terebi o tsuketa.",
        "en": "I turned on the TV without thinking."
      },
      {
        "ja": "なにげなく見た広告が印象に残った。",
        "kana": "なにげなく みた こうこく が いんしょう に のこった。",
        "ro": "Nanigenaku mita koukoku ga inshou ni nokotta.",
        "en": "An ad I saw by chance stuck in my mind."
      },
      {
        "ja": "なにげなく彼の言葉を思い出した。",
        "kana": "なにげなく かれ の ことば を おもいだした。",
        "ro": "Nanigenaku kare no kotoba o omoidashita.",
        "en": "I suddenly remembered his words."
      },
      {
        "ja": "なにげなく歩いていたら、昔の友人に会った。",
        "kana": "なにげなく あるいていたら、むかし の ゆうじん に あった。",
        "ro": "Nanigenaku aruite itara, mukashi no yuujin ni atta.",
        "en": "I was walking casually and ran into an old friend."
      }
    ]
  },
  {
    "id": "n1-adv-069",
    "kanji": "いわば",
    "kana": "いわば",
    "romaji": "iwaba",
    "en": "so to speak; in other words; as it were",
    "examples": [
      {
        "ja": "彼は、いわばチームの心臓だ。",
        "kana": "かれ は、いわば ちーむ の しんぞう だ。",
        "ro": "Kare wa, iwaba chiimu no shinzou da.",
        "en": "He is, so to speak, the heart of the team."
      },
      {
        "ja": "彼女は、いわば会社の顔だ。",
        "kana": "かのじょ は、いわば かいしゃ の かお だ。",
        "ro": "Kanojo wa, iwaba kaisha no kao da.",
        "en": "She is, in a sense, the face of the company."
      },
      {
        "ja": "この制度は、いわば社会の基盤のようなものだ。",
        "kana": "この せいど は、いわば しゃかい の きばん の よう な もの だ。",
        "ro": "Kono seido wa, iwaba shakai no kiban no you na mono da.",
        "en": "This system is, so to speak, the foundation of society."
      },
      {
        "ja": "彼の考えは、いわば哲学のようだ。",
        "kana": "かれ の かんがえ は、いわば てつがく の よう だ。",
        "ro": "Kare no kangae wa, iwaba tetsugaku no you da.",
        "en": "His ideas are, in a way, like philosophy."
      },
      {
        "ja": "この試合は、いわば運命の戦いだった。",
        "kana": "この しあい は、いわば うんめい の たたかい だった。",
        "ro": "Kono shiai wa, iwaba unmei no tatakai datta.",
        "en": "This match was, so to speak, a battle of fate."
      }
    ]
  },
  {
    "id": "n1-adv-070",
    "kanji": "しょせん",
    "kana": "しょせん",
    "romaji": "shosen",
    "en": "after all; in the end; at best",
    "examples": [
      {
        "ja": "しょせん人間は一人では生きられない。",
        "kana": "しょせん にんげん は ひとり では いきられない。",
        "ro": "Shosen ningen wa hitori de wa ikirarenai.",
        "en": "After all, humans can’t live alone."
      },
      {
        "ja": "彼の約束はしょせん口だけだった。",
        "kana": "かれ の やくそく は しょせん くち だけ だった。",
        "ro": "Kare no yakusoku wa shosen kuchi dake datta.",
        "en": "His promise was, in the end, just empty words."
      },
      {
        "ja": "しょせん夢にすぎない話だ。",
        "kana": "しょせん ゆめ に すぎない はなし だ。",
        "ro": "Shosen yume ni suginai hanashi da.",
        "en": "It’s nothing more than a dream after all."
      },
      {
        "ja": "彼はしょせん自分のことしか考えていない。",
        "kana": "かれ は しょせん じぶん の こと しか かんがえて いない。",
        "ro": "Kare wa shosen jibun no koto shika kangaete inai.",
        "en": "He only thinks about himself in the end."
      },
      {
        "ja": "しょせん努力しない人に結果は出ない。",
        "kana": "しょせん どりょく しない ひと に けっか は でない。",
        "ro": "Shosen doryoku shinai hito ni kekka wa denai.",
        "en": "After all, those who don’t try won’t get results."
      }
    ]
  },
  {
    "id": "n1-adv-075",
    "kanji": "ことに",
    "kana": "ことに",
    "romaji": "kotoni",
    "en": "especially; particularly; notably",
    "examples": [
      {
        "ja": "今日はことに寒い。",
        "kana": "きょう は ことに さむい。",
        "ro": "Kyou wa kotoni samui.",
        "en": "It’s especially cold today."
      },
      {
        "ja": "この映画はことに感動的だった。",
        "kana": "この えいが は ことに かんどうてき だった。",
        "ro": "Kono eiga wa kotoni kandouteki datta.",
        "en": "This movie was particularly moving."
      },
      {
        "ja": "彼の笑顔がことに印象的だった。",
        "kana": "かれ の えがお が ことに いんしょうてき だった。",
        "ro": "Kare no egao ga kotoni inshouteki datta.",
        "en": "His smile was especially memorable."
      },
      {
        "ja": "春の京都はことに美しい。",
        "kana": "はる の きょうと は ことに うつくしい。",
        "ro": "Haru no Kyoto wa kotoni utsukushii.",
        "en": "Kyoto in spring is particularly beautiful."
      },
      {
        "ja": "この点がことに重要だ。",
        "kana": "この てん が ことに じゅうよう だ。",
        "ro": "Kono ten ga kotoni juuyou da.",
        "en": "This point is especially important."
      }
    ]
  },
  {
    "id": "n1-adv-079",
    "kanji": "いっさい",
    "kana": "いっさい",
    "romaji": "issai",
    "en": "entirely; absolutely; completely (used with negation)",
    "examples": [
      {
        "ja": "私はその事件にいっさい関係していません。",
        "kana": "わたし は その じけん に いっさい かんけい していません。",
        "ro": "Watashi wa sono jiken ni issai kankei shiteimasen.",
        "en": "I have absolutely nothing to do with that incident."
      },
      {
        "ja": "彼はお金の話をいっさいしなかった。",
        "kana": "かれ は おかね の はなし を いっさい しなかった。",
        "ro": "Kare wa okane no hanashi o issai shinakatta.",
        "en": "He didn’t mention money at all."
      },
      {
        "ja": "この部屋にはいっさいタバコのにおいがしない。",
        "kana": "この へや に は いっさい たばこ の におい が しない。",
        "ro": "Kono heya ni wa issai tabako no nioi ga shinai.",
        "en": "There’s absolutely no smell of tobacco in this room."
      },
      {
        "ja": "彼女はいっさい言い訳をしなかった。",
        "kana": "かのじょ は いっさい いいわけ を しなかった。",
        "ro": "Kanojo wa issai iiwake o shinakatta.",
        "en": "She didn’t make any excuses whatsoever."
      },
      {
        "ja": "この契約では、いっさいの責任を負わない。",
        "kana": "この けいやく では、いっさい の せきにん を おわない。",
        "ro": "Kono keiyaku de wa, issai no sekinin o owanai.",
        "en": "Under this contract, we bear no responsibility whatsoever."
      }
    ]
  }
]