[
  {
    "slug": "launch",
    "date": "2025-11-03",
    "title": "Site Launch Announcement",
    "title_ja": "サイト公開のお知らせ",
    "title_en": "Site Launch Announcement",
    "summary_ja": "nihongotext.com のベータ版を公開しました。いろいろと追加予定です。",
    "summary_en": "We launched the beta of nihongotext.com. We plan to add various things.",
    "tags": ["info", "release"]
  },
  {
    "slug": "search-highlight-update",
    "date": "2025-11-04",
    "title": "Search Highlight Feature Improved",
    "title_ja": "検索ハイライト機能を改善しました",
    "title_en": "Search Highlight Feature Improved",
    "summary_ja": "検索キーワードが単語だけでなく、例文内でも自動的にハイライトされるようになりました。また、検索欄が空になるとハイライトが自動解除されるように調整済みです。",
    "summary_en": "The search highlight feature has been improved. The typed keyword is now highlighted not only in word entries but also inside example sentences. Highlights are automatically removed when the search box is cleared.",
    "tags": ["update", "feature", "search"]
  },
  {
    "slug": "learning-learned-ui-update",
    "date": "2025-11-12",
    "title": "Learning/Learned UI and Ad Display Updated",
    "title_ja": "Learning／Learned 表示と広告機能を改善しました",
    "title_en": "Learning/Learned UI and Ad Display Updated",
    "summary_ja": "「Learning」と「Learned」のUIを改良しました。各ボタン（Learn／Move to Learned／Back to Learning）を右揃えに統一し、ページャー操作時に英語広告がポップアップ表示されるようになりました。また、Learned一覧では5件ずつのページ表示と印刷機能にも対応しています。",
    "summary_en": "The Learning and Learned interfaces have been refined. Action buttons (Learn, Move to Learned, Back to Learning) are now right-aligned, and ads now appear in a popup when navigating through pages. The Learned list now supports 5-item pagination and a printable view.",
    "tags": ["update", "ui", "feature", "ads"]
  },
  {
    "slug": "legal-privacy-contact-lang-toggle",
    "date": "2025-11-17",
    "title": "Legal / Privacy / Contact Pages Updated",
    "title_ja": "利用規約・プライバシー・問い合わせページを改良しました",
    "title_en": "Legal / Privacy / Contact Pages Updated",
    "summary_ja": "legal.html、privacy.html、inquiryページ、blogページのヘッダーとフッターを共通化し、右上に言語トグルボタン（English／日本語）を追加しました。トグル操作でページタイトルや本文表示が英語・日本語に切り替わります。また、問い合わせフォームでは reCAPTCHA と送信ボタンのレイアウトを調整し、見やすさを改善しています。",
    "summary_en": "We unified the header and footer on the legal notice, privacy policy, contact, and blog pages and added a language toggle button (English / 日本語) in the top-right corner. Page titles and text now switch between English and Japanese via the toggle. The contact form layout around reCAPTCHA and the send buttons has also been refined for better readability.",
    "tags": ["update", "ui", "legal", "privacy"]
  },
  {
  "slug": "quiz-feature-added",
  "date": "2025-11-26",
  "title": "Quiz Feature Released",
  "title_ja": "クイズ機能を追加しました",
  "title_en": "Quiz Feature Released",
  "summary_ja": "単語学習画面の右下に「Quiz」ボタンを追加し、簡単にクイズができるようになりました。また、サイト共通ヘッダーにもQuizメニューを追加し、クイズ専用ページへアクセスしやすくなりました。今後はレベルや品詞に応じたクイズ生成や結果表示にも対応予定です。",
  "summary_en": "A floating Quiz button has been added to the vocabulary learning screen, allowing easy access to quizzes. A Quiz menu has also been added to the shared header for quick access to the quiz page. More features are coming, including level- and part-based quiz generation and scoring display.",
  "tags": ["update", "quiz", "feature"]
},
{
  "slug": "sns-links-updated",
  "date": "2025-11-29",
  "title": "SNS Links Updated",
  "title_ja": "SNSリンクを更新しました",
  "title_en": "SNS Links Updated",
  "summary_ja": "ヘッダーのX、Reddit、Medium、Ko-fi、Substackへのリンクを最新のものへ更新しました。これにより、各SNSへ正しくアクセスできるようになり、連携もしやすくなりました。",
  "summary_en": "We updated the social media links in the site header, including X, Reddit, Medium, Ko-fi, and Substack. You can now access our official channels more reliably and stay connected with our updates!",
  "tags": ["update", "sns", "ui"]
},
{
  "slug": "self-introduction-added",
  "date": "2026-02-01",
  "title": "New Content: Self-Introduction",
  "title_ja": "新着：自己紹介のレッスンを公開しました",
  "title_en": "New Content: Self-Introduction",
  "summary_ja": "初心者向けの自己紹介レッスンを追加しました。ネイティブスピーカーによる音声付きで、発音の練習も可能です。基本フレーズから文法解説まで網羅しています。",
  "summary_en": "We added a new self-introduction lesson for beginners! It includes native audio for pronunciation practice, basic phrases, and clear grammar explanations to help you start conversations in Japanese.",
  "tags": ["new-content", "beginner", "audio"]
},
{
  "slug": "new-lessons-shopping-and-restaurant",
  "date": "2026-02-02",
  "title": "New Lessons: Shopping and Restaurant",
  "title_ja": "新着：買い物とレストランのレッスンを公開しました",
  "title_en": "New Lessons: Shopping and Restaurant",
  "summary_ja": "「買い物」と「レストランでの注文」の2つの新しいレッスンを公開しました！どちらもネイティブの音声付きで、日本での日常生活に役立つ実践的なフレーズが学べます。",
  "summary_en": "We've added two new lessons: 'At the Store' and 'Ordering Food'! Both include audio support to help you master essential phrases for your daily life in Japan.",
  "tags": ["new-content", "beginner", "shopping", "dining"]
},
{
  "slug": "station-lesson-added",
  "date": "2026-02-28",
  "title": "New Content: At the Station",
  "title_ja": "新着：駅での会話レッスンを公開しました",
  "title_en": "New Content: At the Station",
  "summary_ja": "日本での移動がスムーズに！駅の場所を聞いたり、切符を買う時に使えるフレーズを音声付きで学びましょう。",
  "summary_en": "Navigate Japanese trains with confidence! Learn how to ask for directions and check fares in our new station-themed lesson.",
  "tags": ["new-content", "beginner", "transport"]
},
  {
    "slug": "quiz-feature-major-update",
    "date": "2026-03-01",
    "title": "Major Update to Quiz Feature",
    "title_ja": "クイズ機能を大幅アップデートしました",
    "title_en": "Major Update to Quiz Feature",
    "summary_ja": "クイズ機能を大幅に改良しました！動詞の活用（例：『着く』→『着きました』）を自動認識して自然な空欄が作られるようになり、すべての問題に英語翻訳を追加しました。デザインもサイト全体と統一し、PC・スマホ両方でより学習しやすくなっています。",
    "summary_en": "We’ve significantly improved the quiz feature! Blanks now naturally adapt to verb conjugations, and English translations are now provided for every question. The design has also been unified with the rest of the site for a seamless learning experience on both desktop and mobile.",
    "tags": ["update", "quiz", "feature"]
  }
  
]
